{"architecture": {"module": "keras", "class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 8], "dtype": "float32", "sparse": false, "name": "dense_input"}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 8]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 16]}}], "build_input_shape": [null, 8]}, "registered_name": null, "build_config": {"input_shape": [null, 8]}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "RMSprop", "config": {"name": "rmsprop", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "rho": 0.9, "momentum": 0.0, "epsilon": 1e-07, "centered": false}, "registered_name": null}, "loss": {"module": "builtins", "class_name": "function", "config": "binary_crossentropy", "registered_name": "function"}, "loss_weights": null, "metrics": [[{"module": "keras.metrics", "class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}, "registered_name": null}]], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true}}, "weights": [[[-0.3022824227809906, -0.13527725636959076, -0.03939817100763321, -0.26222267746925354, -0.2745329737663269, 0.027066927403211594, 0.21296089887619019, -0.057145848870277405, -0.021063772961497307, 0.22455820441246033, -0.2416677176952362, -0.20855477452278137, -0.2017129510641098, -0.2846749722957611, -0.01705765724182129, 0.05297549068927765, -0.1040998250246048, -0.0715445876121521, 0.1540049910545349, -0.23600701987743378, 0.06673841178417206, 0.1289955973625183, -0.2106776237487793, -0.017448890954256058, -0.18506838381290436, -0.23924274742603302, 0.16382655501365662, -0.17041803896427155, 0.09572836756706238, -0.14670759439468384, -0.23131902515888214, -0.1939578503370285, -0.2007557600736618, 0.026682425290346146, 0.24973033368587494, 0.10359294712543488, -0.152957022190094, -0.05762474611401558, -0.06399606913328171, -0.11196622997522354, -0.1836692839860916, 0.20442906022071838, -0.08065811544656754, 0.19147934019565582, 0.1276722401380539, -0.011011744849383831, 0.03355100005865097, 0.17422176897525787, 0.022845091298222542, 0.013738878071308136, 0.2619052231311798, -0.278443306684494, -0.15892043709754944, 0.08055771142244339, -0.034086622297763824, 0.04271328076720238, 0.14328208565711975, 0.239825040102005, 0.22248083353042603, 0.025569049641489983, 0.01702616736292839, 0.03443748503923416, 0.27637580037117004, -0.23685184121131897], [-0.12577441334724426, 0.06393774598836899, 0.025001628324389458, -0.173847496509552, -0.19030922651290894, -0.3140314519405365, -0.203774094581604, 0.038769230246543884, -0.272596150636673, 0.22420591115951538, -0.16121932864189148, 0.16070517897605896, 0.28034576773643494, 0.1949581354856491, 0.2186736762523651, 0.08191976696252823, -0.20513245463371277, 0.1732098013162613, 0.018847137689590454, 0.22647814452648163, 0.12960322201251984, 0.009590204805135727, -0.08170320093631744, 0.1752876192331314, -0.0739041268825531, -0.3180319368839264, -0.07193997502326965, -0.028847871348261833, 0.15906162559986115, 0.11071426421403885, 0.21544533967971802, 0.12124533951282501, 0.3185882568359375, 0.20424170792102814, 0.07740040123462677, 0.013357894495129585, 0.03412007540464401, 0.20022641122341156, 0.066324882209301, -0.13836851716041565, -0.12532325088977814, -0.13929402828216553, 0.015431132167577744, 0.01385470200330019, -0.022380327805876732, 0.1906152218580246, -0.053586315363645554, -0.05038510262966156, -0.2452525496482849, 0.15477129817008972, -0.003080330090597272, 0.17326824367046356, 0.003579160664230585, 0.2932221293449402, -0.14246037602424622, -0.06500236690044403, -0.03802229464054108, 0.3294479250907898, -0.012032934464514256, 0.33325934410095215, 0.057072676718235016, -0.2682352066040039, 0.007570736110210419, -0.2663552463054657], [-0.19105160236358643, -0.22091414034366608, 0.11998646706342697, -0.11425906419754028, -0.09399806708097458, 0.2051943838596344, 0.3092101812362671, -0.22251291573047638, 0.15290804207324982, -0.08032641559839249, -0.2669919431209564, 0.10862118750810623, -0.01041913777589798, -0.18854814767837524, 0.1431901901960373, -0.19051513075828552, 0.09131525456905365, 0.22750341892242432, -0.17234095931053162, -0.0007170549943111837, -0.109568752348423, 0.12323503941297531, 0.13023830950260162, -0.16675373911857605, -0.18661291897296906, 0.1910281926393509, 0.2761474549770355, -0.11556335538625717, 0.18369238078594208, 0.0814427062869072, -0.07624680548906326, -0.12300033867359161, 0.15898354351520538, -0.23295074701309204, -0.018535669893026352, 0.07989900559186935, -0.25131553411483765, 0.13185378909111023, 0.26073959469795227, 0.12201960384845734, 0.20114201307296753, -0.004509434103965759, -0.15780800580978394, 0.030335789546370506, -0.14442741870880127, 0.15062473714351654, 0.1497730165719986, -0.09549082815647125, 0.21932333707809448, -0.33988842368125916, -0.14342603087425232, -0.14771392941474915, -0.14006811380386353, -0.22757554054260254, -0.23407338559627533, -0.061238374561071396, 0.24673208594322205, 0.25765079259872437, 0.0023740483447909355, -0.02606046013534069, 0.1541980803012848, -0.20409901440143585, -0.2279813289642334, 0.04399252310395241], [-0.3037516176700592, -0.16169321537017822, 0.22537462413311005, 0.08937767893075943, -0.22617767751216888, 0.22584876418113708, 0.12386494874954224, -0.11855998635292053, 0.054060034453868866, -0.06459958851337433, -0.19727984070777893, 0.030526163056492805, -0.03753676265478134, 0.0026786949019879103, -0.16547437012195587, 0.1899232417345047, -0.21736684441566467, -0.15165352821350098, -0.026394588872790337, 0.23708197474479675, 0.21244852244853973, 0.23225140571594238, -0.014209811575710773, 0.12641936540603638, -0.2160869687795639, 0.04322788491845131, 0.23253023624420166, -0.09338276833295822, 0.1858862340450287, 0.07471948862075806, 0.02898881956934929, 0.2184758335351944, -0.14996257424354553, 0.0007983162067830563, 0.1260296106338501, 0.0416516549885273, -0.17644847929477692, -0.18788398802280426, 0.22810661792755127, 0.2909053564071655, 0.022131813690066338, 0.028867119923233986, 0.2823233902454376, 0.25022250413894653, 0.11757708340883255, 0.04265761375427246, -0.09870769828557968, -0.11267653852701187, -0.014721634797751904, 0.07625067979097366, 0.12263453751802444, 0.08938733488321304, 0.288490891456604, -0.05044957622885704, -0.24560193717479706, 0.04901149868965149, -0.2817327380180359, -0.07853998243808746, 0.018329735845327377, -0.2123221606016159, 0.060988351702690125, 0.23041099309921265, 0.2253522276878357, 0.06193695217370987], [-0.10404619574546814, -0.2811092734336853, 0.0001786276261555031, -0.12853650748729706, -0.08506687730550766, 0.20065389573574066, 0.20415975153446198, 0.0369265154004097, 0.005433381535112858, 0.25285008549690247, 0.14308810234069824, 0.04762837663292885, -0.0744263157248497, -0.11683456599712372, 0.02322029508650303, -0.08822262287139893, -0.03015025146305561, -0.03364839404821396, 0.22861067950725555, 0.15471704304218292, -0.25413522124290466, 0.18548771739006042, 0.05358896031975746, -0.2552719712257385, -0.08634442836046219, 0.22365841269493103, 0.15216000378131866, 0.2989763915538788, 0.1359439641237259, -0.27552980184555054, 0.24214373528957367, -0.3178451955318451, -0.26332148909568787, 0.17767223715782166, -0.1256982684135437, -0.060498256236314774, -0.22237518429756165, -0.01888289675116539, 0.18934771418571472, -0.24153485894203186, -0.12798786163330078, -0.10400699079036713, -0.10778702795505524, 0.06269387900829315, 0.06251809746026993, -0.05508379638195038, 0.02340543083846569, 0.24246536195278168, -0.12775152921676636, 0.153791144490242, 0.23001989722251892, -0.11429977416992188, 0.017811937257647514, -0.22437016665935516, 0.008455686271190643, -0.15538884699344635, 0.10973064601421356, 0.16632892191410065, -0.18550054728984833, 0.13141252100467682, 0.15753179788589478, 0.18915751576423645, -0.18255719542503357, -0.1036175861954689], [-0.1307150423526764, 0.14524024724960327, 0.24544529616832733, -0.19184231758117676, -0.22534087300300598, 0.038927316665649414, 0.13261160254478455, 0.26261478662490845, -0.11762699484825134, -0.019629260525107384, 0.3077991008758545, -0.3536907732486725, 0.11678110063076019, -0.25226977467536926, -0.06706293672323227, 0.040388576686382294, -0.11050821095705032, -0.13117210566997528, -0.29597869515419006, 0.2174805849790573, -0.36778512597084045, 0.14984969794750214, 0.10680107772350311, 0.12153534591197968, -0.20031042397022247, -0.23576688766479492, 0.28212007880210876, -0.24372225999832153, 0.1686464250087738, 0.09399764239788055, -0.08309633284807205, 0.15742374956607819, 0.08464539796113968, -0.31662964820861816, 0.19299153983592987, -0.3452731966972351, -0.2640703022480011, 0.19527961313724518, 0.08572748303413391, 0.2044474482536316, -0.018575718626379967, -0.14891517162322998, -0.21889032423496246, 0.12284904718399048, 0.1583150327205658, 0.24329686164855957, 0.1681995838880539, -0.2545829117298126, 0.057213541120290756, 0.021927637979388237, 0.22793279588222504, 0.12031236290931702, 0.10912887752056122, 0.18059319257736206, 0.14730791747570038, 0.1768196076154709, 0.086215540766716, -0.23904073238372803, 0.014806777238845825, 0.1022765263915062, 0.06595435738563538, 0.3038426339626312, 0.26609212160110474, -0.143830806016922], [-0.2379511445760727, -0.04521994665265083, -0.12765686213970184, 0.1967351734638214, -0.008351230062544346, -0.25712263584136963, 0.25653529167175293, -0.2018752247095108, 0.07226713001728058, 0.2919599711894989, -0.07749257981777191, 0.06484296917915344, 0.29173892736434937, -0.011803281493484974, -0.14819884300231934, 0.18897558748722076, 0.15082325041294098, 0.08638003468513489, -0.13033786416053772, 0.005644904915243387, 0.09943531453609467, 0.16377156972885132, -0.32061395049095154, 0.0006043173489160836, -0.021109160035848618, -0.19968950748443604, 0.2523248791694641, 0.22528846561908722, 0.1936907321214676, -0.026860782876610756, -0.3273637294769287, 0.19638565182685852, -0.16130593419075012, -0.04143928363919258, 0.06266054511070251, -0.15799161791801453, 0.11402576416730881, -0.0001762088359100744, 0.17773042619228363, -0.10936975479125977, -0.16648882627487183, 0.3394409120082855, -0.2661716043949127, -0.2180224508047104, 0.25591540336608887, 0.06809622794389725, -0.1378958374261856, 0.2669661343097687, -0.15073274075984955, -0.045347366482019424, 0.08284517377614975, -0.20835189521312714, 0.16083742678165436, -0.026467980816960335, 0.018514536321163177, 0.27555206418037415, 0.041240811347961426, 0.1385205239057541, -0.1067502573132515, 0.028729697689414024, 0.22422456741333008, 0.08892837911844254, 0.16255010664463043, -0.0416698083281517], [0.06205872446298599, 0.11635226011276245, -0.22081872820854187, -0.30314168334007263, 0.09632519632577896, 0.05920033901929855, -0.037793874740600586, -0.04585130512714386, 0.06558104604482651, 0.031511444598436356, 0.22243225574493408, 0.09840469807386398, 0.09400864690542221, 0.09007211774587631, -0.0830598920583725, 0.02942274697124958, -0.27941280603408813, -0.3367845118045807, 0.31350770592689514, -0.05562187358736992, -0.06437520682811737, 0.018333574756979942, -0.05174616351723671, 0.12669163942337036, 0.1441425085067749, -0.34096789360046387, 0.07052049040794373, 0.2031390219926834, 0.21844062209129333, -0.17452658712863922, -0.15143340826034546, 0.02062670700252056, -0.12454251945018768, 0.03273625671863556, 0.17074570059776306, -0.2610650062561035, 0.08467117697000504, -0.14557865262031555, -0.10133925080299377, -0.10997278988361359, -0.2482534497976303, 0.05766436830163002, -0.25349634885787964, -0.12357223033905029, 0.16774456202983856, -0.05019644647836685, -0.007928885519504547, 0.19867126643657684, -0.12560752034187317, 0.12272176146507263, 0.15446904301643372, 0.19485408067703247, -0.24209211766719818, 0.023440347984433174, 0.015184133313596249, -0.024494243785738945, 0.025097541511058807, 0.1874089390039444, 0.2159002274274826, -0.14220865070819855, 0.04362496733665466, -0.02354693040251732, -0.08727114647626877, -0.26988157629966736]], [0.05769282951951027, -0.02428584359586239, -0.0017490183236077428, 0.058049049228429794, 0.03602302819490433, 0.08721931278705597, -0.030308883637189865, -0.045416682958602905, 0.06683994084596634, 0.012769775465130806, -0.021263262256979942, 0.11104445159435272, 0.015390216372907162, 0.0556986965239048, 0.03751026466488838, -0.010581147857010365, 0.04142380878329277, 0.016943663358688354, 0.01409104559570551, 0.012618671171367168, 0.06434019654989243, -0.018163813278079033, 0.04913156107068062, 0.08444724231958389, 0.0346929132938385, 0.02133365161716938, -0.04493395984172821, -0.025579603388905525, 0.021540991961956024, 0.015513278543949127, 0.031477946788072586, 0.03272252529859543, 0.010007545351982117, 0.08066503703594208, 0.021458223462104797, -0.0020892040338367224, 0.014128080569207668, -0.0440061092376709, -0.036504317075014114, 0.03690684586763382, 0.030455105006694794, -0.06423351913690567, 0.06888586282730103, 0.010857176035642624, -0.07423887401819229, 0.02335953153669834, -0.0619976744055748, 0.028008416295051575, 0.04863683134317398, 0.012282907031476498, -0.05911552160978317, 0.02908952161669731, 0.06981652230024338, 0.00644440483301878, 0.05247234180569649, -0.0221250019967556, -0.007622826844453812, -0.0022519079502671957, -0.04317716136574745, -0.05803022161126137, -0.026773005723953247, 0.047996263951063156, 0.016047228127717972, 0.05261881649494171], [[-0.0642821192741394, -0.05764957144856453, -0.17370373010635376, 0.0446796640753746, -0.09978964924812317, -0.03114255703985691, 0.18571148812770844, 0.09836874902248383, -0.07859037816524506, -0.08394020795822144, 0.15752296149730682, -0.09224259853363037, -0.18152382969856262, 0.1620362401008606, -0.014503330923616886, -0.1612742841243744, -0.2349589318037033, 0.03438737243413925, -0.09205678850412369, -0.1277797371149063, 0.012831136584281921, 0.052074987441301346, 0.2868002951145172, 0.022028950974345207, 0.11331544071435928, 0.1530338078737259, -0.010672306641936302, -0.053030338138341904, -0.09284652769565582, 0.1332310140132904, 0.047665249556303024, 0.12998594343662262], [-0.141475647687912, -0.06683484464883804, 0.08947455883026123, -0.08579792082309723, 0.19155316054821014, -0.1642409712076187, 0.009325149469077587, 0.1227511540055275, -0.04901035130023956, 0.13185811042785645, -0.13623204827308655, -0.03319404646754265, -0.04573460668325424, 0.1795939803123474, -0.1513535976409912, -0.08925739675760269, 0.14587616920471191, -0.1127709373831749, -0.04381761699914932, 0.07462754100561142, -0.027561025694012642, 0.17094743251800537, -0.15439605712890625, -0.07991983741521835, -0.11047088354825974, -0.03153252974152565, 0.204983651638031, 0.07300228625535965, -0.047390326857566833, 0.040083322674036026, -0.06981436908245087, -0.12110819667577744], [0.16398848593235016, 0.058766141533851624, -0.13775305449962616, 0.10969866067171097, 0.111569344997406, -0.11896347999572754, 0.176608145236969, -0.05556585267186165, 0.13882726430892944, -0.19407838582992554, -0.08186020702123642, -0.17590348422527313, -0.02536003850400448, -0.009482377208769321, 0.13046108186244965, -0.1331719011068344, 0.0659329891204834, 0.12330077588558197, 0.05187858268618584, -0.1327042281627655, 0.12413832545280457, 0.04066741466522217, 0.11006471514701843, -0.0990823432803154, 0.029972678050398827, 0.13145533204078674, 0.037718310952186584, 0.16343551874160767, 0.1712137758731842, 0.2513110637664795, -0.14327816665172577, -0.17063196003437042], [0.06947389245033264, 0.3255772590637207, -0.041387889534235, -0.17069248855113983, 0.10866671055555344, -0.08554968237876892, 0.16806265711784363, 0.17883849143981934, 0.06953331083059311, -0.12825725972652435, 0.32735294103622437, -0.08952565491199493, 0.19120249152183533, 0.05766541510820389, -0.11696646362543106, 0.10735423862934113, -0.3130016326904297, -0.17241492867469788, 0.07480219751596451, 0.1282801479101181, 0.14491458237171173, -0.025012891739606857, 0.12415003031492233, 0.03550964221358299, 0.27475544810295105, -0.1193876713514328, -0.19498996436595917, 0.013777707703411579, 0.26364147663116455, 0.04184546694159508, 0.09061289578676224, -0.007371056824922562], [-0.005980617832392454, 0.2882353663444519, -0.13977830111980438, 0.04663459584116936, -0.04445556923747063, 0.1867227852344513, 0.08639085292816162, 0.20287223160266876, 0.11430878937244415, -0.044963229447603226, 0.21159672737121582, 0.015482769347727299, -0.06996572762727737, 0.20933467149734497, 0.02071484923362732, -0.13809862732887268, 0.09510951489210129, 0.15027476847171783, 0.09702781587839127, 3.7780904676765203e-05, 0.10943038016557693, 0.20933794975280762, 0.12014317512512207, 0.035912107676267624, -0.14635895192623138, 0.19362713396549225, 0.22940371930599213, -0.018992269411683083, 0.2685471177101135, -0.09928753226995468, -0.12469694018363953, -0.02762230671942234], [0.11588457226753235, 0.11435988545417786, -0.03423817455768585, 0.16437916457653046, -0.1644556075334549, 0.0003760775725822896, 0.02094365283846855, -0.09267815202474594, 0.03809754177927971, -0.2583818733692169, -0.0006590769626200199, 0.1683279126882553, 0.05461437255144119, 0.002525585237890482, -0.1455192267894745, 0.0289933979511261, -0.1992516964673996, -0.1708044409751892, 0.207990363240242, 0.08305822312831879, 0.02490471862256527, -0.04209267348051071, 0.2647607624530792, -0.09341400116682053, 0.24232341349124908, 0.001244483981281519, -0.03640596568584442, 0.00898374430835247, 0.1186380684375763, -0.12185395509004593, -0.003128885291516781, -0.19846861064434052], [0.01960628479719162, 0.13752886652946472, -0.07079870998859406, 0.2184595763683319, -0.08110097050666809, -0.04164760932326317, -0.16555127501487732, -0.1404327154159546, -0.054693929851055145, -0.11150316894054413, -0.2310672104358673, -0.10746540874242783, 0.2075011432170868, -0.08024949580430984, 0.138187974691391, -0.023238681256771088, 0.11997244507074356, 0.012750011868774891, 0.15547704696655273, -0.10469186305999756, -0.15721184015274048, 0.12504148483276367, -0.09372010827064514, -0.08872788399457932, 0.14154686033725739, 0.25088608264923096, -0.13539434969425201, 0.09701711684465408, -0.017456064000725746, 0.09144885838031769, 0.15196466445922852, -0.04851212725043297], [0.10359586775302887, 0.18000918626785278, -0.1450643390417099, 0.015555616468191147, -0.09840661287307739, -0.15009385347366333, 0.1487436592578888, -0.1684483289718628, 0.11531651020050049, -0.03049185685813427, -0.1705692857503891, -0.00899932999163866, 0.03165289759635925, -0.010168388485908508, 0.20918501913547516, -0.06459549814462662, 0.12853820621967316, 0.16533568501472473, -0.052572835236787796, -0.17464910447597504, -0.022963285446166992, -0.14525343477725983, 0.06618214398622513, -0.02371581457555294, -0.13229778409004211, -0.2022632360458374, 0.11166965216398239, -0.0025551242288202047, 0.11123092472553253, 0.0780959501862526, 0.14042550325393677, 0.13620196282863617], [0.1477520763874054, 0.08612656593322754, -0.1585136204957962, -0.06138451024889946, 0.18979401886463165, -0.0500885546207428, 0.10545456409454346, 0.08678992092609406, -0.0002484641154296696, 0.04068232327699661, 0.21640917658805847, -0.06827108561992645, 0.2281591147184372, 0.22957780957221985, -0.14695456624031067, 0.05397484824061394, 0.032236479222774506, -0.03637402504682541, 0.18330426514148712, 0.17004550993442535, 0.11990469694137573, -0.13384953141212463, 0.275439977645874, 0.07255025207996368, 0.20707064867019653, -0.15784063935279846, -0.014952619560062885, -0.1971428096294403, 0.2663327157497406, 0.11300671100616455, -0.03328473120927811, -0.07209771126508713], [-0.10022541880607605, -0.02884584851562977, 0.02092803083360195, -0.13094472885131836, 0.03201219439506531, -0.1268511414527893, -0.1951896846294403, -0.13370509445667267, -0.16455644369125366, 0.08392469584941864, 0.039146121591329575, 0.10965176671743393, 0.10157044976949692, 0.0387774296104908, -0.0023742644116282463, 0.04037965089082718, 0.24021285772323608, -0.07597420364618301, 0.09653446823358536, 0.0809829980134964, 0.006315453909337521, -0.02180418372154236, -0.24839670956134796, -0.022986600175499916, -0.16141563653945923, 0.26371222734451294, -0.22330665588378906, -0.15755446255207062, 0.14324797689914703, -0.08443891257047653, 0.08239050954580307, 0.03500399366021156], [-0.0820690393447876, -0.18565461039543152, -0.20243503153324127, 0.07432694733142853, -0.2434370219707489, 0.17515011131763458, -0.1807861477136612, -0.07469107955694199, 0.006726974621415138, -0.23496600985527039, -0.022585628554224968, -0.20880289375782013, 0.1788533627986908, -0.16659538447856903, -0.035405538976192474, 0.18374700844287872, 0.1672758013010025, -0.06747462600469589, 0.04891393706202507, 0.08619280904531479, -0.06261517852544785, 0.09330667555332184, -0.08823085576295853, 0.004058505408465862, -0.2116776555776596, 0.15599530935287476, 0.027079906314611435, 0.20356528460979462, 0.2210247665643692, 0.039890993386507034, 0.004062792286276817, 0.15823768079280853], [-0.11827433109283447, -0.07075698673725128, 0.03685762360692024, 0.1019882783293724, 0.25157275795936584, -0.018239211291074753, -0.1784721165895462, 0.2132846713066101, -0.06602198630571365, 0.07206720113754272, 0.14310798048973083, -0.0800904929637909, -0.1159043163061142, 0.09069281816482544, 0.02285073883831501, 0.06804651021957397, -0.1181243509054184, 0.13726618885993958, 0.16145050525665283, 0.24714164435863495, 0.1138889491558075, -0.10540146380662918, 0.15218639373779297, -0.015933113172650337, 0.06579787284135818, 0.15933239459991455, -0.12236395478248596, -0.1711055338382721, 0.09160207957029343, -0.127436563372612, -0.018669169396162033, -0.15442168712615967], [0.037938639521598816, 0.05679801478981972, -0.03288143500685692, 0.19034799933433533, 0.12709836661815643, -0.10688682645559311, -0.004837546963244677, 0.12249015271663666, 0.12689828872680664, 0.24679461121559143, -0.14792172610759735, -0.1319931298494339, -0.08392371982336044, -0.1737843006849289, 0.0940457358956337, 0.07999168336391449, 0.24006658792495728, -0.1346711814403534, -0.18840248882770538, 0.11117254942655563, -0.021460024639964104, -0.0632314458489418, 0.0322272926568985, 0.07599096745252609, -0.1476701945066452, -0.132992222905159, -0.0412602424621582, -0.11042939126491547, -0.20719461143016815, 0.01373972650617361, -0.11967109888792038, 0.025808347389101982], [0.035787589848041534, -0.1993943750858307, 0.19410164654254913, -0.12943141162395477, 0.27422448992729187, -0.010467355139553547, -0.053983986377716064, 0.03950223699212074, 0.10003706812858582, 0.0050435918383300304, -0.08749430626630783, -0.013308963738381863, 0.04150191321969032, -0.06174483150243759, 0.1626039296388626, -0.006528214551508427, 0.0948917418718338, 0.152630016207695, 0.2242523431777954, 0.20721188187599182, 0.009826150722801685, 0.20287373661994934, -0.040846843272447586, 0.046519018709659576, -0.022075578570365906, 0.2458878606557846, -0.09087527543306351, -0.1511131227016449, 0.12070674449205399, 0.11021783947944641, 0.02689298987388611, -0.011285565793514252], [0.03639828413724899, -0.24034515023231506, 0.21833176910877228, 0.11265812814235687, 0.1814907193183899, 0.0511716827750206, -0.05963418260216713, 0.12239480763673782, -0.10548897087574005, -0.11496640741825104, -0.21524278819561005, 0.10917691886425018, 0.1558721512556076, 0.11859983950853348, 0.06934528052806854, -0.04121032729744911, 0.14926955103874207, -0.1448068916797638, -0.07674537599086761, 0.1643363982439041, -0.14370383322238922, -0.04935453087091446, 0.2333851456642151, -0.03644765540957451, -0.06028519198298454, -0.14978930354118347, -0.05954257771372795, 0.06298095732927322, -0.05020406097173691, 0.14904674887657166, -0.04692654684185982, -0.17024412751197815], [-0.034967150539159775, -0.020854240283370018, -0.09716653823852539, -0.1767781376838684, -0.06906526535749435, 0.08289404958486557, -0.027055498212575912, -0.05630108341574669, -0.037679899483919144, 0.219849094748497, -0.13506588339805603, -0.14496202766895294, -0.1221255511045456, 0.08762255311012268, -0.11167824268341064, -0.08302225917577744, 0.15249815583229065, -0.04672607034444809, -0.2025771588087082, 0.17533570528030396, 0.14723707735538483, -0.06938953697681427, -0.1631077080965042, -0.03365844488143921, -0.09849956631660461, 0.06577198952436447, 0.11427754908800125, -0.0928167775273323, 0.0017051832983270288, 0.1492004543542862, -0.06925072520971298, 0.007100973278284073], [0.08036695420742035, 0.3571214973926544, -0.08358331024646759, 0.016716839745640755, -0.2227882444858551, 0.3020799458026886, -0.02459990233182907, -0.15256847441196442, -0.07189733535051346, -0.13718664646148682, 0.06298348307609558, -0.05343076214194298, 0.17002570629119873, 0.18439394235610962, 0.04442843422293663, -0.04950666055083275, -0.12253411114215851, -0.14360135793685913, 0.29909494519233704, 0.08155228197574615, 0.03895425796508789, 0.10956984758377075, 0.22436630725860596, 0.046795230358839035, 0.017227986827492714, -0.19918784499168396, -0.19174224138259888, -0.04221115633845329, -0.02141403965651989, -0.006825530435889959, 0.11808732897043228, -0.052802905440330505], [0.08553264290094376, -0.05711093172430992, 0.07895772159099579, 0.02818044275045395, -0.04250890389084816, 0.224320188164711, 0.1593567281961441, -0.10213623940944672, -0.09836605191230774, 0.002858897903934121, 0.08376841247081757, 0.17251677811145782, 0.16307948529720306, 0.05134213715791702, -0.12975898385047913, 0.20570702850818634, -0.049792613834142685, 0.15259553492069244, 0.043986398726701736, 0.009242130443453789, -0.06098427250981331, -0.08185189962387085, -0.17838850617408752, -0.08297720551490784, -0.007689659018069506, 0.13490968942642212, 0.21467852592468262, 0.10946252942085266, 0.2263246774673462, 0.23782619833946228, 0.09356849640607834, -0.08831053227186203], [0.13366124033927917, 0.1428503394126892, 0.15030156075954437, -0.2061624377965927, 0.05794861540198326, 0.05459550395607948, 0.08400732278823853, -0.08770610392093658, -0.19934844970703125, -0.16109630465507507, 0.2978721559047699, 0.1653369665145874, -0.11250339448451996, -0.11414114385843277, 0.0240198764950037, -0.1611184924840927, -0.05519538372755051, -0.1483207643032074, 0.01243310421705246, 0.02937733381986618, -0.047241710126399994, -0.22775045037269592, 0.06551797688007355, 0.012483006343245506, 0.2560988664627075, -0.1895313411951065, 0.07673048228025436, 0.07570147514343262, -0.15208537876605988, -0.053139828145504, -0.07317705452442169, -0.10865525156259537], [-0.006822200957685709, -0.1706920713186264, 0.08432438224554062, -0.1660386174917221, 0.044664159417152405, 0.031454648822546005, 0.077255979180336, -0.1196286678314209, -0.0322207547724247, -0.043083131313323975, -0.11772715300321579, 0.07772687077522278, -0.1437598615884781, -0.11720037460327148, 0.19762732088565826, 0.29551297426223755, -0.015118359588086605, 0.08117590099573135, 0.08029734343290329, 0.20923519134521484, -0.12123328447341919, -0.09496916830539703, 0.18810735642910004, 0.03655092790722847, -0.025404920801520348, 0.07222389429807663, 0.0854443684220314, 0.09688210487365723, -0.1297808140516281, 0.11314017325639725, 0.07541855424642563, -0.10183832049369812], [0.1488049328327179, -0.05902354419231415, 0.0620400533080101, -0.05708162114024162, 0.2598583400249481, 0.20980021357536316, -0.08250288665294647, 0.24051271378993988, -0.0874958485364914, -0.048063796013593674, 0.14279252290725708, -0.017723092809319496, 0.13343563675880432, -0.04634900391101837, -0.09570680558681488, 0.24027828872203827, -0.20605337619781494, 0.08422602713108063, 0.08846073597669601, 0.25103309750556946, -0.09203433245420456, 0.13551850616931915, 0.019636839628219604, 0.03159915283322334, 0.117142453789711, -0.05761312320828438, -0.06123029813170433, -0.08877556771039963, 0.031758006662130356, 0.1228351891040802, 0.014868861995637417, 0.09731446206569672], [0.09578673541545868, -0.0993117019534111, -0.19911235570907593, -0.09963475167751312, -0.0953521877527237, -0.0826418325304985, 0.0003585589292924851, -0.13658177852630615, -0.08821513503789902, 0.18731483817100525, -0.09262081980705261, 0.21234764158725739, -0.033790070563554764, 0.035531576722860336, -0.026854630559682846, 0.1255224049091339, -0.06321690231561661, -0.07299152761697769, -0.2276337593793869, -0.07396573573350906, -0.11475955694913864, 0.13995040953159332, 0.017382238060235977, 0.01169847883284092, 0.1542189121246338, 0.26009759306907654, -0.12935291230678558, 0.07421473413705826, 0.028052033856511116, -0.06481730192899704, 0.08992888033390045, 0.16064678132534027], [-0.0052814483642578125, -0.061552174389362335, -0.11193311959505081, 0.09330343455076218, -0.17527179419994354, 0.16906487941741943, 0.15722709894180298, 0.006754300091415644, 0.09711352735757828, 0.09292574226856232, 0.087675541639328, -0.09233253449201584, 0.1889735460281372, -0.024154745042324066, 0.18095660209655762, -0.10789308696985245, 0.1893179714679718, 0.19802460074424744, 0.16477999091148376, -0.17148956656455994, -0.07973948866128922, -0.1089736595749855, 0.1921089142560959, -0.09165895730257034, -0.059814903885126114, -0.17744851112365723, -0.19575414061546326, -0.15456421673297882, 0.1688411831855774, 0.033698637038469315, 0.16288518905639648, -0.14319688081741333], [-0.06471779197454453, -0.16805580258369446, 0.07240001112222672, 0.10662727802991867, 0.22522245347499847, -0.10923091322183609, -0.1626216024160385, 0.07643476128578186, -0.1386987715959549, -0.08126618713140488, -0.01361059956252575, -0.15988858044147491, -0.07109790295362473, -0.03638765215873718, -0.18805567920207977, 0.05345873907208443, 0.028042567893862724, -0.03781144320964813, 0.18407867848873138, -0.15209800004959106, -0.01154679898172617, -0.03740410506725311, -0.0263302531093359, -0.08230417966842651, 0.12329517304897308, 0.020896468311548233, 0.2078121304512024, -0.1508401781320572, -0.1426846832036972, 0.0626225695014, -0.05874547362327576, 0.1666775941848755], [-0.10292675346136093, 0.21445083618164062, -0.016600649803876877, 0.10995843261480331, -0.07631182670593262, 0.08579302579164505, -0.009744919836521149, 0.060496553778648376, -0.09412550181150436, -0.08095718920230865, 0.20817270874977112, 0.07924943417310715, -0.013618115335702896, 0.0888131856918335, 0.15104566514492035, -0.10786691308021545, 0.14590249955654144, -0.07374334335327148, 0.19222770631313324, -0.14478683471679688, 0.18175698816776276, -0.0014760850463062525, 0.04151809215545654, -0.11884894967079163, 0.04969726502895355, 0.05298621580004692, 0.20041996240615845, -0.1045723706483841, -0.00744022848084569, -0.14998336136341095, 0.1542188972234726, -0.010304293595254421], [-0.09609964489936829, -0.06340987980365753, -0.07466971129179001, -0.10794387757778168, -0.11379241943359375, 0.30956873297691345, -0.021723516285419464, -0.07216934859752655, 0.13829085230827332, 0.1013062596321106, 0.013610493391752243, -0.10183325409889221, 0.07356197386980057, 0.010906537994742393, -0.16877244412899017, -0.20988428592681885, 0.07365062087774277, 0.0935215950012207, 0.044615488499403, -0.057978153228759766, 0.05608000606298447, -0.13270746171474457, 0.27296531200408936, 0.05646413937211037, -0.059148725122213364, -0.06970712542533875, 0.10846005380153656, -0.10932435840368271, 0.3179561495780945, 0.23236382007598877, 0.057299643754959106, -0.027703309431672096], [-0.0740090012550354, -0.19243408739566803, -0.213032066822052, 0.049988843500614166, 0.02836696244776249, 0.05752119794487953, -0.005549739580601454, 0.16896282136440277, -0.017411673441529274, 0.1287938356399536, -0.13574577867984772, -0.01706574857234955, -0.08791083097457886, -0.05996730178594589, 0.21629638969898224, 0.019695838913321495, -0.051843199878931046, -0.12985558807849884, -0.09894228726625443, -0.17116515338420868, -0.10649903863668442, 0.15216213464736938, -0.07611974328756332, 0.06883224844932556, 0.05684025585651398, -0.1781114637851715, 0.15243270993232727, -0.13745592534542084, -0.192129448056221, -0.1484242081642151, -0.22315572202205658, -0.08451138436794281], [-0.008689293637871742, 0.10012544691562653, 0.1870003342628479, 0.11730825901031494, -0.008556746877729893, -0.0451008565723896, -0.16053736209869385, 0.09685292094945908, -0.08601498603820801, -0.09020501375198364, 0.2101425677537918, 0.03872748091816902, 0.054797254502773285, 0.04832995682954788, -0.12229718267917633, 0.17585889995098114, 0.09907793998718262, 0.02337496355175972, -0.11916350573301315, -0.07665086537599564, -0.11292612552642822, 0.1367616504430771, 0.06339849531650543, 0.06721088290214539, 0.08998808264732361, 0.04509783908724785, -0.04222465306520462, -0.20174191892147064, 0.010666784830391407, 0.053542837500572205, 0.015057590790092945, -0.08318842947483063], [0.04619951546192169, 0.03678612783551216, -0.20626196265220642, 0.04358811676502228, -0.012922018766403198, -0.09556905180215836, 0.029883839190006256, 0.11768541485071182, 0.10688694566488266, -0.10400006175041199, -0.015774769708514214, 0.1662822961807251, 0.0176659245043993, 0.06852361559867859, -0.1427047848701477, 0.03811928629875183, 0.13028371334075928, -0.0030508728232234716, 0.14650113880634308, -0.1874241679906845, 0.14087314903736115, -0.08531525731086731, -0.10277529060840607, 0.02902906760573387, 0.06863983720541, 0.0206762608140707, -0.18359874188899994, 0.16203026473522186, -0.16326949000358582, 0.009450444020330906, -9.297174983657897e-06, -0.1206488162279129], [-0.11770212650299072, 0.13358445465564728, 0.07579415291547775, 0.05913687124848366, -0.08046218752861023, 0.031090639531612396, -0.015466270968317986, -0.11851789802312851, 0.21591582894325256, 0.01142020896077156, -0.06139075383543968, -0.06927589327096939, 0.2134103626012802, -0.13633117079734802, 0.021269550547003746, 0.2255512923002243, -0.05176100507378578, 0.17490646243095398, -0.0005051547777839005, 0.030024029314517975, 0.0735938623547554, 0.011400170624256134, 0.1386735737323761, 0.07836898416280746, -0.07923727482557297, -0.06081594154238701, 0.0689040943980217, 0.12810073792934418, -0.08021359145641327, 0.10617367178201675, 0.05260883644223213, -0.06119460612535477], [0.07291622459888458, -0.08799878507852554, -0.04522736743092537, 0.0751131996512413, 0.18900325894355774, 0.11803426593542099, 0.14383676648139954, 0.2823634445667267, 0.10641537606716156, 0.172384113073349, 0.2536311447620392, 0.1020345613360405, 0.25163722038269043, 0.0679602324962616, 0.09475446492433548, -0.044180575758218765, 0.053719159215688705, -0.06511564552783966, -0.0776565819978714, 0.12187092006206512, -0.01579078659415245, 0.0643438994884491, -0.10389930754899979, -0.08639650046825409, 0.21045105159282684, -0.08233058452606201, -0.15873795747756958, 0.011470301076769829, -0.013522975146770477, 0.1674867868423462, 0.047518644481897354, -0.02632017247378826], [-0.06179884076118469, 0.03178883716464043, -0.06322561204433441, 0.012258091941475868, -0.007558505050837994, -0.1730962097644806, -0.10093178600072861, 0.1721525937318802, 0.022319449111819267, 0.19342076778411865, -0.249551922082901, -0.10896602272987366, 0.1781371831893921, -0.009221768006682396, 0.13071759045124054, 0.0950552299618721, 0.14065049588680267, 0.1652681529521942, 0.1796468049287796, 0.2080797404050827, -0.16265781223773956, 0.05048038437962532, -0.01990058273077011, 0.15292225778102875, 0.01551042404025793, 0.20211684703826904, -0.03802192583680153, -0.05707131326198578, -0.10670623183250427, 0.17963944375514984, 0.1267399936914444, 0.020988736301660538], [0.09429676830768585, 0.03723584860563278, 0.12884557247161865, 0.22593523561954498, 0.24642308056354523, -0.030642542988061905, -0.22023768723011017, 0.09731266647577286, 0.023138830438256264, -0.0579049251973629, -0.062181174755096436, -0.05493007227778435, 0.15932366251945496, -0.17117591202259064, 0.11743239313364029, -0.17785625159740448, 0.06635639816522598, 0.24655364453792572, -0.24975533783435822, 0.026629436761140823, 0.0682455524802208, 0.12064836174249649, -0.20640718936920166, 0.01505281962454319, 0.21332432329654694, 0.004046402871608734, 0.09815520793199539, -0.20533592998981476, -0.06482372432947159, 0.046339862048625946, -0.06112333759665489, -0.08117444068193436], [-0.06349717080593109, 0.06236455217003822, 0.21219858527183533, 0.13984566926956177, -0.0034951071720570326, 0.03579925745725632, 0.14745326340198517, -0.07171259820461273, -0.01981169916689396, 0.2179793417453766, -0.07232553511857986, -0.11936890333890915, 0.11787913739681244, -0.1820252537727356, 0.23749080300331116, -0.14585158228874207, -0.18119782209396362, -0.07760828733444214, 0.11972043663263321, 0.06515205651521683, 0.03749926760792732, 0.09481502324342728, 0.0698539987206459, -0.06373822689056396, 0.1452811062335968, 0.13701817393302917, 0.1795896589756012, 0.15688523650169373, -0.06834342330694199, 0.22073887288570404, -0.0319654755294323, 0.108668752014637], [0.016442323103547096, -0.045739639550447464, 0.10671523213386536, -0.19811829924583435, -0.059910066425800323, 0.10073982179164886, -0.16117899119853973, 0.2137293815612793, 0.145990788936615, 0.1987156867980957, 0.16161367297172546, 0.20752175152301788, 0.13109570741653442, 0.18379050493240356, 0.12401391565799713, 0.1345905065536499, 0.13365760445594788, -0.057968541979789734, -0.07256695628166199, -0.033350590616464615, 0.16467885673046112, -0.1774602085351944, 0.06981094926595688, 0.038428451865911484, 0.020975366234779358, 0.2346922606229782, 0.0943027213215828, -0.0825665295124054, 0.03393622487783432, 0.11028063297271729, 0.01199106965214014, -0.07462061196565628], [-0.041970428079366684, -0.0438116081058979, -0.0360199473798275, 0.04236700385808945, -0.05314594507217407, 0.04477335512638092, -0.08633457869291306, 0.07104046642780304, -0.05695808306336403, 0.04771336540579796, -0.14509736001491547, 0.0944160595536232, 0.011644139885902405, 0.23149748146533966, 0.18571794033050537, 0.21011437475681305, -0.15777362883090973, 0.11083834618330002, -0.06680990755558014, 0.1021762266755104, 0.004088859539479017, -0.04512906074523926, 0.046214260160923004, -0.07803933322429657, 0.17964906990528107, 0.056471873074769974, -0.14123404026031494, -0.07875768840312958, 0.08550369739532471, 0.15903133153915405, 0.007711302489042282, 0.20390018820762634], [0.18981170654296875, 0.08942186832427979, -0.15261821448802948, 0.04561566188931465, 0.01926574483513832, -0.03954659774899483, 0.06513528525829315, -0.002213449450209737, 0.07161605358123779, 0.10963382571935654, 0.1803262084722519, 0.11471543461084366, -0.1373668611049652, 0.20667147636413574, 0.07374410331249237, 0.184120312333107, 0.08032301813364029, 0.013559935614466667, 0.09808732569217682, -0.14797727763652802, -0.0145998140797019, -0.19314642250537872, 0.10807665437459946, -0.042156774550676346, -0.06384067982435226, -0.026815064251422882, -0.05212539806962013, -0.05132223665714264, -0.05246427282691002, 0.09761367738246918, -0.04664331302046776, 0.005933264270424843], [0.07456115633249283, 0.1313866227865219, 0.06247931718826294, 0.157924085855484, 0.2106403261423111, -0.05721018835902214, 0.08771481364965439, -0.16428519785404205, 0.09768606722354889, -0.05933431163430214, 0.01975315622985363, -0.035785652697086334, 0.0997481718659401, 0.01254697423428297, -0.1216338723897934, 0.07584096491336823, -0.04817507788538933, -0.12948836386203766, -0.14559292793273926, -0.20186004042625427, 0.034224983304739, 0.05784493684768677, -0.17109598219394684, -0.025346621870994568, 0.11554963141679764, 0.14034563302993774, 0.1217506155371666, -0.14114803075790405, 0.03235478326678276, 0.013404310680925846, -0.09608754515647888, -0.01408098079264164], [0.1645437479019165, 0.2081274390220642, -0.14423665404319763, 0.06325408816337585, -0.020153138786554337, -0.1371496468782425, 0.11484719812870026, 0.007709295488893986, -0.06499125063419342, -0.1496065855026245, -0.16331468522548676, 0.21310162544250488, 0.020293379202485085, -0.0713050588965416, 0.200555220246315, -0.026836218312382698, 0.23985795676708221, 0.04809822142124176, -0.20662491023540497, -0.14303509891033173, 0.17137764394283295, 0.01434130035340786, 0.2040412724018097, -0.06893787533044815, -0.14687137305736542, 0.15503685176372528, 0.06250730156898499, -0.04028446227312088, -0.1535518914461136, -0.1849764883518219, -0.1145453229546547, 0.1338452249765396], [0.18596883118152618, 0.07468517869710922, -0.09437087923288345, 0.11949984729290009, 0.0028518084436655045, 0.03724564239382744, 0.12118443101644516, 0.22002173960208893, 0.20848459005355835, 0.10114509612321854, 0.3028748631477356, -0.10321526974439621, -0.033903818577528, -0.036448847502470016, -0.1933610886335373, -0.22198179364204407, -0.19984310865402222, 0.07999054342508316, 0.17528527975082397, 0.025097088888287544, -0.08382391929626465, -0.10182254761457443, 0.24069228768348694, 0.057078611105680466, 0.2631887197494507, -0.07927802950143814, -0.1416681706905365, 0.06145939603447914, -0.02229880355298519, 0.015520558692514896, -0.005691720172762871, 0.08492696285247803], [-0.08591412007808685, -0.029785465449094772, -0.12205065041780472, 0.14555460214614868, -0.13168910145759583, 0.10756954550743103, 0.04136412963271141, -0.05145113170146942, -0.036757297813892365, -0.04154384136199951, 0.30828022956848145, -0.06735935807228088, -0.0008358361665159464, 0.07592122256755829, 0.08327750116586685, 0.18405279517173767, 0.019272712990641594, 0.0434594564139843, 0.033046431839466095, 0.13150593638420105, 0.14964446425437927, -0.05874360725283623, 0.14350828528404236, 0.029672769829630852, 0.2597157657146454, 0.09083207696676254, -0.09156713634729385, -0.025508655235171318, 0.02021370269358158, 0.05713967978954315, 0.01301412470638752, -0.02842240035533905], [-0.13077376782894135, 0.06461936235427856, -0.16293156147003174, -0.052797235548496246, -0.10522385686635971, -0.043125443160533905, 0.07087600976228714, 0.20600511133670807, 0.06357797235250473, 0.014599383808672428, 0.17660903930664062, 0.06347552686929703, 0.15396654605865479, -0.1451837122440338, 0.13968004286289215, -0.1222798079252243, 0.061608586460351944, -0.10843407362699509, 0.012083050794899464, -0.09327587485313416, 0.05914049968123436, 0.08264166861772537, -0.06575019657611847, -0.007094405125826597, -0.08546068519353867, 0.22827540338039398, -0.3190787434577942, 0.027206338942050934, 0.07668769359588623, -0.02000168338418007, -0.03550397604703903, 0.13831183314323425], [-0.01110276859253645, 0.019542397931218147, 0.2091643512248993, -0.22083668410778046, 0.18020527064800262, 0.0976298376917839, -0.1439257264137268, 0.25013530254364014, 0.004938425496220589, 0.028132278472185135, 0.30427366495132446, 0.022379448637366295, -0.0007911105058155954, -0.14469535648822784, 0.05973570793867111, -0.0830298438668251, -0.13228732347488403, 0.029675688594579697, 0.11938640475273132, -0.05321506783366203, -0.03917735815048218, -0.09948505461215973, -0.15997610986232758, -0.08454373478889465, -0.08100080490112305, -0.11808986216783524, -0.12590008974075317, -0.14269882440567017, -0.17246568202972412, 0.09519610553979874, 0.04633038118481636, -0.09045784920454025], [-0.1809888631105423, -0.17801082134246826, 0.022249778732657433, 0.06457328051328659, -0.14212800562381744, 0.12628614902496338, -0.06942988187074661, 0.10686932504177094, -0.05472142994403839, -0.15946607291698456, 0.16845381259918213, -0.12275197356939316, -0.11931345611810684, -0.11026608198881149, -0.15902598202228546, 0.00023427262203767896, -0.03054332733154297, -0.17335209250450134, 0.038662537932395935, -0.013554929755628109, 0.09557533264160156, -0.005978547967970371, -0.033417921513319016, -0.0033990489318966866, -8.663979679113254e-05, 0.17762233316898346, -0.1298634111881256, 0.21101193130016327, -0.08629962056875229, 0.19991832971572876, -0.10632073879241943, 0.2195088267326355], [-0.1674647331237793, -0.031905416399240494, -0.03168392926454544, -0.17697298526763916, 0.036530379205942154, -0.020889637991786003, 0.06021192669868469, 0.0010552575113251805, 0.1363588124513626, -0.015533019788563251, -0.19608880579471588, 0.01739998534321785, -0.0693773478269577, -0.024519750848412514, -0.02984965220093727, 0.1959724724292755, 0.22695112228393555, 0.022606179118156433, 0.07713868468999863, 0.017871882766485214, -0.08799757808446884, 0.07871925830841064, -0.17434871196746826, -0.02275650016963482, 0.03906307369470596, -0.06061813235282898, -0.14749503135681152, -0.1283024698495865, 0.10990745574235916, 0.022966040298342705, 0.1406787484884262, -0.10562703758478165], [-0.15846602618694305, 0.007245846092700958, -0.09592704474925995, -0.011259975843131542, 0.24686188995838165, -0.12406578660011292, 0.0064514935947954655, 0.000352369446773082, -0.0721120834350586, 0.18351908028125763, 0.15851937234401703, -0.07256004959344864, -0.15621508657932281, -0.054846055805683136, 0.039704546332359314, 0.2320084124803543, -0.13408666849136353, 0.062497615814208984, 0.18564152717590332, -0.13639819622039795, 0.1881125420331955, -0.14782121777534485, 0.2303890734910965, -0.032505542039871216, -0.11703502386808395, 0.13111457228660583, 0.06461881101131439, -0.06867510080337524, -0.054576121270656586, -0.11797511577606201, 0.06260707229375839, -0.0276473518460989], [0.00758161349222064, -0.050087716430425644, -0.13109776377677917, -0.08776392787694931, -0.10522859543561935, -0.1365816444158554, 0.004318507853895426, -0.14032968878746033, -0.02573845349252224, -0.055518507957458496, -0.01063560415059328, 0.11821290105581284, 0.06324564665555954, -0.11187560856342316, 0.22369885444641113, -0.15435166656970978, -0.07287921756505966, 0.02660367637872696, -0.1536751240491867, -0.10510147362947464, 0.034343548119068146, 0.0013669587206095457, -0.08976362645626068, -0.007394410669803619, 0.1597447246313095, 0.028177466243505478, 0.0995573028922081, -0.12237820774316788, -0.02400457300245762, -0.15236543118953705, -0.10693299025297165, -0.017544159665703773], [0.08622121810913086, -0.03832727670669556, 0.0786474421620369, 0.03620005398988724, -0.13521823287010193, -0.054587699472904205, -0.015738578513264656, -0.09211079776287079, 0.03482545167207718, 0.2234601378440857, 0.19459354877471924, 0.17956732213497162, -0.07192693650722504, 0.21252794563770294, -0.1871786266565323, -0.006228339392691851, 0.18557541072368622, -0.024843528866767883, -0.0018264979589730501, -0.21433918178081512, -0.023337500169873238, -0.11149153113365173, 0.11286567151546478, -0.019975891336798668, 0.08850954473018646, 0.009303847327828407, -0.017815299332141876, 