{"architecture": {"module": "keras", "class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 8], "dtype": "float32", "sparse": false, "name": "dense_input"}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 8]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 16]}}], "build_input_shape": [null, 8]}, "registered_name": null, "build_config": {"input_shape": [null, 8]}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "RMSprop", "config": {"name": "rmsprop", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "rho": 0.9, "momentum": 0.0, "epsilon": 1e-07, "centered": false}, "registered_name": null}, "loss": {"module": "builtins", "class_name": "function", "config": "binary_crossentropy", "registered_name": "function"}, "loss_weights": null, "metrics": [[{"module": "keras.metrics", "class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}, "registered_name": null}]], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true}}, "weights": [[[-0.2160249501466751, 0.19844327867031097, -0.17995551228523254, 0.27091947197914124, -0.1767631620168686, -0.24229413270950317, -0.23811379075050354, -0.18427026271820068, 0.017646772786974907, -0.1825340837240219, -0.23687097430229187, 0.04129256680607796, 0.24157604575157166, 0.29520490765571594, 0.07497692108154297, -0.07856705784797668, 0.24956552684307098, 0.20658423006534576, -0.15841591358184814, -0.15238048136234283, 0.15425440669059753, -0.2316531240940094, -0.14936761558055878, 0.1665894240140915, -0.08808394521474838, -0.14980335533618927, 0.009413441643118858, 0.25504353642463684, 0.14526686072349548, 0.09884773194789886, -0.32700416445732117, -0.01565363071858883, 0.09340854734182358, -0.03766632080078125, -0.20419175922870636, 0.1403757780790329, 0.1429717242717743, 0.06712523847818375, 0.10389275848865509, -0.1142122820019722, 0.09588015079498291, -0.23879678547382355, 0.04623056575655937, -0.18724605441093445, -0.18984182178974152, 0.0365348644554615, 0.2229517549276352, 0.26306426525115967, -0.06037944182753563, -0.2092639058828354, 0.24224139750003815, -0.23389121890068054, -0.16308684647083282, -0.034547943621873856, -0.291493684053421, -0.11464571952819824, 0.102630615234375, 0.06299872696399689, -0.007920373231172562, -0.31573933362960815, 0.1699548214673996, 0.2229537069797516, -0.14860428869724274, 0.14945712685585022], [0.08962427824735641, -0.33279862999916077, -0.14653266966342926, -0.14433465898036957, 0.29866355657577515, -0.20846927165985107, 0.25067853927612305, 0.15564946830272675, 0.08844976127147675, 0.19931022822856903, -0.07087444514036179, 0.005912599619477987, 0.037359777837991714, 0.21332606673240662, 0.08741272985935211, -0.1913691610097885, 0.15699313580989838, -0.27073219418525696, 0.1905180960893631, -0.13552504777908325, 0.04366962984204292, -0.2427101731300354, 0.07544778287410736, 0.1431376039981842, 0.2624661326408386, 0.1753602772951126, 0.02386830933392048, 0.026608198881149292, 0.01989934779703617, 0.13152597844600677, 0.11194456368684769, -0.18617123365402222, -0.039910938590765, -0.2813758850097656, 0.23757654428482056, 0.1599656492471695, -0.2935192883014679, -0.10923570394515991, 0.08597862720489502, -0.2539859116077423, -0.2180308997631073, -0.002135724760591984, -0.2694380581378937, 0.2626837193965912, -0.22865816950798035, -0.11695794016122818, 0.2983666658401489, 0.21748334169387817, 0.12878984212875366, -0.03250514715909958, 0.305294930934906, -0.012066598050296307, -0.23295703530311584, -0.21236437559127808, 0.20738008618354797, -0.0657254233956337, 0.26859721541404724, -0.20395731925964355, 0.0038071712478995323, -0.25554701685905457, 0.07115117460489273, 0.1524338573217392, -0.18122580647468567, 0.14403173327445984], [0.2610493302345276, -0.16494891047477722, -0.14016643166542053, -0.06272396445274353, 0.01817825622856617, 0.18802793323993683, -0.1439540535211563, 0.12860217690467834, 0.16555972397327423, -0.21812038123607635, -0.04885368421673775, 0.07427474856376648, 0.02359701320528984, -0.05085394158959389, 0.01516718976199627, -0.2315889596939087, -0.1368229240179062, -0.23434054851531982, 0.08488280326128006, -0.12068625539541245, -0.20841331779956818, 0.17917756736278534, 0.29275405406951904, 0.19834670424461365, -0.10161716490983963, 0.11219432950019836, -0.21724051237106323, -0.09380492568016052, -0.25763562321662903, 0.05698327347636223, 0.1500691920518875, -0.11038202047348022, 0.2602483034133911, -0.002213635016232729, 0.1621609926223755, 0.20017307996749878, 0.2366967499256134, -0.033683136105537415, -0.13192875683307648, -0.22992417216300964, 0.18317635357379913, 0.21493278443813324, -0.25636717677116394, -0.018706630915403366, 0.10270553827285767, 0.25486984848976135, -0.2820116877555847, 0.2552834451198578, 0.04148781672120094, 0.10615842044353485, 0.011104983277618885, 0.006884116679430008, 0.15495868027210236, 0.2514883577823639, -0.14727337658405304, -0.06854948401451111, -0.07891548424959183, -0.10195914655923843, -0.058056287467479706, 0.1479109823703766, 0.013926281593739986, -0.023941729217767715, 0.23479905724525452, -0.07570832967758179], [-0.09031256288290024, 0.05767809599637985, -0.09167475998401642, -0.1812872439622879, -0.2813907861709595, 0.2793940305709839, -0.06612879037857056, 0.03202538192272186, 0.24390055239200592, -0.07820294052362442, 0.24014794826507568, 0.032775577157735825, 0.20489099621772766, 0.2032291442155838, -0.12906590104103088, 0.27489569783210754, 0.01878368854522705, -0.016586700454354286, 0.052855126559734344, -0.14888915419578552, -0.2770700752735138, 0.3143579065799713, 0.14542432129383087, -0.06999873369932175, 0.0333683118224144, 0.20750489830970764, -0.05715489014983177, -0.20887330174446106, 0.14561325311660767, 0.10397424548864365, 0.19592060148715973, 0.22531218826770782, 0.2706221342086792, -0.215287983417511, -0.1975986361503601, -0.15870557725429535, -0.2249174565076828, 0.15567675232887268, 0.19335100054740906, -0.13543248176574707, 0.10446958988904953, 0.13789613544940948, -0.1833963543176651, -0.05802992731332779, -0.0973721593618393, -0.12633904814720154, 0.14633674919605255, -0.02069697342813015, 0.20295093953609467, 0.02067784033715725, -0.13737450540065765, 0.034460462629795074, -0.20605508983135223, 0.15454445779323578, 0.17835041880607605, -0.22979210317134857, -0.25281795859336853, 0.15782764554023743, 0.279446005821228, -0.041437700390815735, 0.17291949689388275, 0.020535549148917198, -0.15768571197986603, 0.23440790176391602], [-0.018453508615493774, -0.11788947135210037, -0.008688950911164284, -0.04281375929713249, -0.25713738799095154, -0.1035940945148468, 0.0501638688147068, -0.04886508733034134, 0.10671095550060272, 0.2446201741695404, 0.1492745578289032, 0.2316417098045349, 0.2094273418188095, 0.19301189482212067, -0.18151545524597168, -0.16779965162277222, -0.22294864058494568, 0.27857181429862976, 0.03356336057186127, 0.18819387257099152, 0.3100314140319824, 0.04033684730529785, 0.26329031586647034, 0.0005989687633700669, -0.1918434202671051, -0.25040656328201294, 0.27171778678894043, -0.15249080955982208, -0.15366661548614502, -0.038414448499679565, -0.23130196332931519, 0.046137236058712006, -0.2799881398677826, -0.24390166997909546, 0.20600852370262146, -0.1194886639714241, -0.10607045888900757, 0.14147406816482544, 0.14992326498031616, -0.21250054240226746, 0.28809818625450134, -0.1648937314748764, -0.00019698907271958888, -0.09170353412628174, 0.07649330794811249, 0.07971121370792389, 0.1649918258190155, 0.21025432646274567, -0.006080597173422575, -0.3040602505207062, 0.13882845640182495, -0.14895839989185333, -0.13949693739414215, -0.25246453285217285, 0.038471292704343796, 0.13922081887722015, 0.09601520746946335, 0.2165970355272293, 0.18188564479351044, -0.1876874417066574, -0.18365471065044403, 0.19017772376537323, 0.16542784869670868, 0.024672145023941994], [0.1324596405029297, 0.1019435003399849, 0.10233858972787857, 0.18468143045902252, -0.16544653475284576, -0.017758337780833244, -0.21026983857154846, -0.03339977189898491, 0.14821834862232208, -0.19865259528160095, 0.1206655353307724, 0.07180661708116531, 0.13259552419185638, -0.1407642364501953, -0.06850168108940125, -0.2640834152698517, 0.25461238622665405, -0.3079528212547302, 0.09159179776906967, -0.23950403928756714, -0.23317743837833405, -0.1896657794713974, 0.040957383811473846, 0.14619937539100647, 0.14318965375423431, -0.15587405860424042, 0.2433730959892273, -0.21261921525001526, -0.022555934265255928, 0.05837169289588928, -0.11124039441347122, -0.06318587809801102, 0.1621166616678238, -0.2153891772031784, 0.22424498200416565, 0.1734270304441452, -0.13168562948703766, -0.07827908545732498, -0.10480288416147232, -0.08629409968852997, 0.22139860689640045, -0.004497655667364597, 0.14053264260292053, 0.24452891945838928, 0.0484137125313282, 0.24514417350292206, -0.017951669171452522, -0.03442835435271263, 0.060245923697948456, -0.3504463732242584, 0.00860661081969738, 0.06735356897115707, -0.21560345590114594, -0.013762027956545353, -0.2939300537109375, -0.16032861173152924, -0.2262292355298996, -0.21363995969295502, -0.05627523735165596, -0.19872644543647766, 0.1112026646733284, 0.1127178817987442, -0.24653753638267517, 0.19259876012802124], [0.12452201545238495, 0.2146735042333603, 0.12625853717327118, 0.1658477783203125, 0.28566446900367737, 0.07486506551504135, 0.2082131952047348, -0.0893164873123169, -0.22998659312725067, 0.07450210303068161, 0.029721511527895927, 0.12314450740814209, 0.2534676492214203, 0.24670705199241638, 0.08402421325445175, -0.27104514837265015, -0.18245738744735718, -0.0734347328543663, 0.14421211183071136, 0.19975876808166504, 0.20971965789794922, -0.23968669772148132, 0.2151709944009781, 0.10967932641506195, 0.03139100596308708, -0.03733598813414574, 0.22589725255966187, 0.18071694672107697, -0.10600381344556808, 0.10852106660604477, -0.15121206641197205, -0.02994249202311039, 0.10160963237285614, 0.08605582267045975, -0.07318003475666046, -0.16872179508209229, 0.11253367364406586, -0.0036722004879266024, 0.2269909679889679, -0.31803303956985474, -0.026169903576374054, 0.08533032983541489, 0.15719164907932281, 0.2648780643939972, -0.08283869922161102, -0.05129405856132507, 0.1789322793483734, -0.225833460688591, 0.26270604133605957, -0.0843852087855339, 0.17965789139270782, -0.1398499608039856, 0.10639306902885437, 0.25746384263038635, -0.07719940692186356, 0.008530455641448498, -0.22695709764957428, -0.19771774113178253, -0.08114509284496307, 0.07151732593774796, 0.20042912662029266, -0.2450580596923828, -0.14354035258293152, 0.156711146235466], [-0.2983221709728241, -0.14267155528068542, 0.12195620685815811, 0.1056646853685379, 0.27177271246910095, -0.15946584939956665, 0.11807732284069061, 0.18563203513622284, 0.19941222667694092, 0.18862180411815643, 0.07025384157896042, 0.09352142363786697, 0.0795007199048996, 0.0271600354462862, -0.07018163055181503, -0.19139380753040314, 0.14720967411994934, 0.259243369102478, 0.14424623548984528, -0.31448617577552795, 0.07372202724218369, -0.2945639193058014, 0.04386134818196297, -0.0857149213552475, 0.01959526166319847, 0.12289184331893921, 0.026035604998469353, -0.11432435363531113, 0.13376741111278534, 0.0645628273487091, -0.21231406927108765, -0.17611326277256012, 0.14988824725151062, 0.27063336968421936, 0.17939907312393188, 0.14431950449943542, -0.2108561247587204, 0.09395108371973038, 0.04462959244847298, 0.05737442523241043, -0.06385159492492676, 0.06818981468677521, -0.2248484492301941, 0.2656819820404053, 0.21260201930999756, -0.26241499185562134, -0.03244435787200928, -0.16073882579803467, 0.15009231865406036, 0.07606925070285797, -0.1747143417596817, -0.3493393361568451, -0.05258931219577789, 0.10735875368118286, -0.24268685281276703, -0.14700184762477875, -0.13507723808288574, 0.08933831006288528, -0.11493583768606186, -0.11762749403715134, 0.2532147765159607, -0.2630026638507843, -0.3410995304584503, 0.020656533539295197]], [0.0331457145512104, 0.05072903633117676, 0.0344863198697567, 0.00830426812171936, 0.020781084895133972, 0.06673236936330795, 0.04006824269890785, -0.05339313670992851, 0.013727906160056591, 0.001456816797144711, 0.005548514425754547, -0.006135578732937574, 0.011985832825303078, -0.02192254550755024, 0.0060479482635855675, 0.05268653854727745, -0.005386325065046549, -0.011178549379110336, 0.022054623812437057, 0.024041298776865005, 0.04269268736243248, 0.02827506884932518, -0.00777421472594142, -0.004415550734847784, 0.02045259065926075, 0.06862813234329224, 0.022500425577163696, 0.06803753226995468, -0.00020732812117785215, 0.009697278030216694, 0.05577941611409187, 0.03793136775493622, 0.051769327372312546, 0.03351293131709099, 0.030114341527223587, -0.03798995167016983, 0.02657134085893631, -0.036697786301374435, -0.005410431884229183, 0.08579478412866592, -0.009776407852768898, -0.05543934553861618, 0.06415782868862152, 0.04626762121915817, 0.03340141102671623, 0.04739599674940109, 0.029347192496061325, -0.03380366042256355, -0.017600562423467636, 0.1064218059182167, -0.018656469881534576, 0.055040035396814346, -0.05528188496828079, 0.04447279870510101, 0.025499524548649788, -0.010584316216409206, 0.040461886674165726, -0.053984276950359344, -0.0029697518330067396, 0.04709135368466377, -0.006262726150453091, 0.004938620142638683, 0.07225438207387924, -0.03404318913817406], [[0.04485292732715607, 0.1359158158302307, 0.004128810949623585, -0.019743910059332848, 0.10128776729106903, -0.11397295445203781, 0.0017853787867352366, -0.04752066358923912, -0.24870581924915314, -0.06425870209932327, 0.034436747431755066, -0.025005070492625237, 0.10663141310214996, -0.012839936651289463, 0.09903102368116379, -0.055574171245098114, 0.13854266703128815, 0.0834909975528717, 0.16762103140354156, 0.23949401080608368, 0.11043037474155426, -0.10557550936937332, -0.07945369184017181, -0.059881988912820816, -0.07053196430206299, 0.009863716550171375, 0.2356545627117157, -0.04099556803703308, -0.08622970432043076, 0.0967613235116005, -0.25124168395996094, -0.09601722657680511], [-0.13117313385009766, -0.12349748611450195, 0.14488159120082855, -0.042912427335977554, -0.019026491791009903, 0.18362565338611603, 0.08239994943141937, 0.004727052990347147, 0.0178257804363966, -0.06245013326406479, 0.09608346968889236, -0.16027675569057465, 0.07269067317247391, 0.10485611110925674, 0.23958246409893036, -0.058289069682359695, 0.11812315136194229, -0.07288461923599243, -0.05862434580922127, 0.18566596508026123, -0.17754775285720825, -0.09995958209037781, -0.00995237659662962, 0.064020074903965, -0.09388918429613113, 0.22453941404819489, -0.09130846709012985, 0.17032518982887268, 0.1223004013299942, 0.048854559659957886, -0.04756409302353859, 0.0994434505701065], [-0.06385403126478195, 0.21783573925495148, -0.06263500452041626, -0.013492092490196228, -0.16712883114814758, -0.1702413260936737, -0.07538777589797974, 0.05562129616737366, -0.18652021884918213, -0.15665286779403687, 0.11128834635019302, 0.09425656497478485, 0.10067276656627655, 0.09605374187231064, -0.12188760191202164, 0.2141539603471756, -0.025252407416701317, -0.17744669318199158, 0.06220603734254837, -0.17158856987953186, 0.07570907473564148, 0.014013916254043579, -0.07375884056091309, -0.12009185552597046, 0.029476068913936615, 0.19131281971931458, 0.23326700925827026, 0.01235033106058836, 0.20684896409511566, 0.1349009871482849, 0.16586671769618988, -0.14492590725421906], [-0.12256359308958054, -0.028709961101412773, -0.11118148267269135, -0.10219908505678177, 0.11681532859802246, 0.13029934465885162, 0.17832188308238983, -0.11765148490667343, -0.09854292869567871, 0.10923883318901062, -0.11357609182596207, 0.16596432030200958, -0.1208002045750618, 0.08800898492336273, 0.1932087242603302, 0.05766286700963974, 0.0008382556261494756, -0.06580337882041931, -0.034808192402124405, -0.03879856690764427, -0.12732702493667603, 0.12197981774806976, -0.08219914138317108, 0.021189536899328232, -0.15632465481758118, -0.1620914787054062, -0.15735559165477753, -0.1591111570596695, 0.006237457040697336, 0.13146960735321045, 0.011459712870419025, 0.17717425525188446], [-0.059213899075984955, -0.06942486763000488, -0.0467352494597435, 0.08949615061283112, -0.0459953173995018, 0.20191816985607147, -0.0746009349822998, -0.011025717481970787, 0.20463469624519348, -0.10289862006902695, 0.10823008418083191, 0.07510321587324142, 0.11263022571802139, 0.09865870326757431, 0.19229869544506073, -0.18713897466659546, 0.03863329440355301, -0.0470297671854496, 0.08757053315639496, -0.0012360726250335574, 0.04123133420944214, -0.05482354387640953, 0.01676228456199169, 0.10124886780977249, 0.058592457324266434, 0.19477422535419464, 0.11026131361722946, -0.1942296028137207, 0.19224987924098969, -0.10772353410720825, -0.1359339952468872, 0.2636010944843292], [-0.1547069102525711, -0.025268351659178734, 0.18530750274658203, 0.2646917700767517, -0.017726469784975052, 0.19842135906219482, 0.14769190549850464, -0.18206696212291718, -0.0872291624546051, 0.07637201249599457, 0.218633234500885, -0.01124480739235878, 0.24541817605495453, -0.12244205921888351, -0.15358524024486542, -0.15817447006702423, -0.08510039001703262, 0.1594085842370987, -0.001201062579639256, 0.1684713065624237, 0.125309556722641, -0.06357160955667496, -0.08085094392299652, -0.026272950693964958, -0.07903699576854706, 0.15053899586200714, 0.07530464231967926, 0.1967344582080841, -0.04694352671504021, 0.012571288272738457, 0.16667300462722778, -0.09666670858860016], [-0.013757328502833843, 0.041404761373996735, -0.015322616323828697, 0.06839402765035629, 0.2024441808462143, 0.25685322284698486, 0.035513848066329956, 0.13118617236614227, 0.10091565549373627, 0.15627378225326538, -0.22241607308387756, 0.08128674328327179, -0.015390260145068169, 0.011805000714957714, -0.1704655885696411, -0.16841909289360046, 0.10935239493846893, -0.10443124920129776, 0.10021078586578369, 0.013611133210361004, 0.24053321778774261, -0.004228636156767607, 0.0060634920373559, -0.09023827314376831, -0.13132750988006592, 0.23337675631046295, 0.0978219285607338, -0.03285357728600502, 0.11009816080331802, -0.03624211624264717, 0.06538072973489761, -0.019910361617803574], [-0.021191753447055817, 0.040033064782619476, -0.053336869925260544, -0.15241311490535736, 0.13218726217746735, -0.06399261206388474, 0.1828184723854065, 0.016522131860256195, 0.225679412484169, 0.12512409687042236, 0.22210896015167236, 0.11783793568611145, -0.09040586650371552, -0.09503825008869171, -0.026495007798075676, 0.10915174335241318, 0.08510599285364151, 0.049649037420749664, 0.11654140800237656, 0.012215194292366505, -0.005260894540697336, 0.04715845733880997, -0.01051342487335205, 0.10786689817905426, -0.0021696120966225863, -0.061593446880578995, 0.051104944199323654, -0.2062525451183319, 0.19447389245033264, -0.07329205423593521, 0.03495871648192406, -0.1630716174840927], [-0.10227072983980179, 0.0700596272945404, 0.09105266630649567, -0.0028837742283940315, 0.05530628561973572, -0.21258658170700073, -0.09569349884986877, 0.12488339841365814, 0.09586331248283386, -0.13057589530944824, 0.12671853601932526, -0.0026983635034412146, 0.0415504090487957, -0.08848780393600464, -0.2520187497138977, -0.08774816989898682, -0.18254216015338898, -0.1439281404018402, -0.0530262365937233, 0.15273380279541016, -0.10974305123090744, -0.15956757962703705, -0.04536430910229683, -0.016675636172294617, 0.038264065980911255, 0.17442800104618073, 0.09351705014705658, 0.1813552975654602, 0.18482407927513123, -0.022717833518981934, 0.037220269441604614, 0.10337984561920166], [0.15597154200077057, -0.05418238788843155, 0.08111570030450821, 0.04625162482261658, 0.047753799706697464, 0.11016124486923218, 0.14573226869106293, 0.1640886515378952, -0.17232725024223328, -0.017072992399334908, 0.2562344968318939, 0.08672751486301422, -0.1672603338956833, 0.13375945389270782, -0.08147414773702621, 0.011808174662292004, -0.16260293126106262, 0.07390590757131577, 0.2134709358215332, -0.006710308138281107, 0.06096547469496727, 0.15290305018424988, 0.13171246647834778, 0.03500598669052124, -0.03350922837853432, 0.03748178482055664, 0.23784564435482025, 0.20402933657169342, -0.08839946240186691, -0.21886089444160461, -0.17287051677703857, 0.1466819792985916], [-0.12053097039461136, -0.17727725207805634, -0.09991148859262466, 0.06399605423212051, -0.10873200744390488, -0.1701887845993042, -0.03421840816736221, 0.07907390594482422, -0.11077810078859329, 0.1804478019475937, 0.02831050008535385, 0.0855126827955246, -0.1049133762717247, 0.10380557179450989, 0.19542884826660156, 0.14822301268577576, 0.10454442352056503, -0.05828463286161423, 0.20983454585075378, 0.1745443046092987, 0.11924824118614197, 0.16628843545913696, -0.006901203189045191, -0.19892634451389313, -0.25135669112205505, 0.08146939426660538, 0.13574375212192535, -0.013583088293671608, 0.11609473824501038, 0.09390705823898315, -0.19544357061386108, 0.1663254201412201], [-0.21075573563575745, 0.17196090519428253, -0.006932664196938276, -0.10510467737913132, -0.05276351422071457, -0.03439188748598099, -0.15681859850883484, -0.05090281739830971, -0.017424918711185455, -0.08956900238990784, -0.12775740027427673, -0.21325838565826416, -0.16290374100208282, 0.05426384136080742, 0.14998012781143188, -0.07049981504678726, -0.0033403723500669003, -0.12268853187561035, 0.13828802108764648, 0.07407322525978088, -0.0843004658818245, 0.12358923256397247, -0.04781436175107956, 0.17193955183029175, 0.0471557155251503, 0.11982255429029465, -0.07606887817382812, 0.09101062268018723, 0.01771763153374195, 0.004020655993372202, 0.16557607054710388, 0.11526644229888916], [0.034490276128053665, 0.09330759942531586, -0.09566005319356918, -0.19680963456630707, 0.1264817863702774, -0.15940459072589874, -0.113212950527668, -0.08117350935935974, 0.042838145047426224, -0.037391893565654755, -0.06165173277258873, -0.17418399453163147, -0.120350681245327, -0.17750035226345062, 0.07985497266054153, 0.001289716106839478, 0.11536180973052979, -0.07277597486972809, -0.019508693367242813, -0.03611156716942787, 0.03543106094002724, -0.12690940499305725, 0.07076830416917801, -0.02925133891403675, -0.130014568567276, 0.2315988689661026, 0.15856917202472687, 0.04037640243768692, 0.19748884439468384, 0.23868675529956818, 0.14029164612293243, 0.014576707035303116], [0.22832316160202026, -0.2019570916891098, 0.009840882383286953, -0.04068784788250923, -0.08356582373380661, 0.10013978183269501, -0.16647520661354065, -0.07024607807397842, 0.19728611409664154, 0.031608495861291885, 0.10489241778850555, 0.08141107857227325, 0.10006812959909439, 0.1765369474887848, 0.19715619087219238, 0.19127649068832397, -0.15933860838413239, 0.06803569942712784, 0.06996147334575653, 0.1536843627691269, -0.1702985316514969, -0.024824777618050575, -0.006244582124054432, 0.2114868015050888, 0.21432220935821533, 0.1674545258283615, -0.08437655121088028, -0.2282533347606659, -0.10134920477867126, 0.25631335377693176, 0.22112490236759186, 0.1779661923646927], [-0.05353406071662903, -0.16558125615119934, 0.07459869980812073, -0.053603656589984894, 0.12550945580005646, -0.010514949448406696, 0.056496672332286835, 0.0815582349896431, 0.06852911412715912, -0.054902371019124985, -0.11454302072525024, 0.08754520863294601, -0.002009791787713766, -0.07321751862764359, -0.022375721484422684, -0.04943959787487984, -0.006614735350012779, -0.09628637880086899, 0.02796144038438797, -0.1701217144727707, -0.05347625911235809, 0.16746684908866882, -0.08439888060092926, -0.05939106270670891, -0.09667444974184036, 0.2555886209011078, 0.053725164383649826, 0.06923382729291916, 0.01853247918188572, -0.11239562928676605, 0.13792335987091064, -0.025325695052742958], [-0.007719910237938166, -0.08658989518880844, -0.008485573343932629, 0.26292088627815247, -0.049128953367471695, 0.2147449404001236, -0.11534923315048218, -0.007284610997885466, -0.19098569452762604, 0.01276711467653513, 0.02667052485048771, 0.04035244882106781, -0.08112616837024689, 0.12104751169681549, -0.016404608264565468, -0.01840595155954361, -0.06623204797506332, 0.08318502455949783, 0.11408956348896027, -0.019223641604185104, 0.22865521907806396, 0.07997985929250717, -0.1512666791677475, 0.035623569041490555, 0.07369094341993332, -0.12492965161800385, 0.03681493178009987, 0.206628680229187, -0.062183622270822525, -0.05935399606823921, -0.2141888439655304, -0.171677365899086], [0.008155728690326214, 0.010880425572395325, 0.17576932907104492, -0.168051078915596, 0.09418328106403351, -0.11818290501832962, -0.20511643588542938, -0.09883808344602585, -0.023099813610315323, 0.17238901555538177, -0.08070287853479385, -0.14234286546707153, 0.10616054385900497, -0.17783157527446747, -0.03316353261470795, -0.015171673148870468, 0.06769654154777527, -0.2281263768672943, -0.010103737004101276, -0.04276897385716438, 0.19509339332580566, 0.05374576896429062, -0.12091462314128876, 0.19121725857257843, 0.09151660650968552, 0.16545073688030243, -0.12741684913635254, 0.22182504832744598, 0.11595416814088821, 0.18439292907714844, 0.07435041666030884, -0.1416466236114502], [0.047771651297807693, -0.040635015815496445, 0.05363187566399574, 0.244014173746109, -0.038212064653635025, -0.21196851134300232, 0.24421723186969757, 0.013125348836183548, 0.16829051077365875, -0.02055525965988636, -0.07344648987054825, -0.028198424726724625, 0.18773306906223297, 0.16798029839992523, -0.0682777464389801, 0.2007751762866974, -0.11079338192939758, 0.057644471526145935, 0.06874008476734161, 0.30228671431541443, 0.02592400275170803, -0.05997379124164581, 0.11313621699810028, 0.036686334758996964, 0.1260989010334015, -0.10372220724821091, 0.2843381464481354, 0.1925446093082428, -0.21042300760746002, 0.14193804562091827, -0.05156297981739044, -0.16564857959747314], [0.11231829226016998, 0.13070648908615112, 0.03681093081831932, 0.06523378938436508, 0.025601595640182495, -0.1831616759300232, -0.193409264087677, -0.12736772000789642, 0.037178244441747665, 0.11493068933486938, -0.1348370462656021, 0.25287795066833496, 0.042823221534490585, 0.18496949970722198, -0.08819663524627686, -0.017811084166169167, 0.12959405779838562, 0.07523342221975327, -0.030132394284009933, -0.0422128327190876, 0.23123860359191895, 0.07029066234827042, -0.07630705833435059, 0.1282271444797516, -0.17728818953037262, 0.06763530522584915, -0.13865599036216736, -0.25052860379219055, 0.054640088230371475, 0.1749613732099533, -0.12324988842010498, 0.12984195351600647], [-0.07872683554887772, 0.14558382332324982, 0.22039881348609924, -0.06846413016319275, -0.21708783507347107, -0.06379623711109161, 0.26990509033203125, -0.08932435512542725, 0.07350220531225204, 0.01938159205019474, -0.21038351953029633, -0.0884864553809166, 0.02324611321091652, 0.08524435013532639, -0.1719711720943451, -0.0025455099530518055, 0.06478489935398102, 0.2930627167224884, 0.006595284212380648, 0.19888344407081604, 0.16445298492908478, -0.02419394440948963, 0.03632264956831932, -0.12643609941005707, -0.160670205950737, -0.19747497141361237, 0.1224297434091568, 0.023027222603559494, -0.2006157785654068, -0.22451436519622803, -0.11700182408094406, -0.07163673639297485], [0.26345768570899963, -0.008629191666841507, 0.22292819619178772, 0.22879938781261444, -0.08350443094968796, 0.23033197224140167, 0.14352887868881226, 0.10622404515743256, -0.19373124837875366, -0.1664513200521469, 0.2162477821111679, 0.06176024675369263, 0.0651715025305748, -0.14313377439975739, 0.2325383722782135, 0.2287701964378357, 0.07857830822467804, 0.257824182510376, 0.18416091799736023, -0.06061685457825661, -0.07196006923913956, -0.047240931540727615, 0.0908617377281189, 0.18168343603610992, -0.16441528499126434, 0.12096551060676575, -0.1137528121471405, 0.19187529385089874, -0.008346929214894772, -0.07866788655519485, -0.1235431581735611, 0.06371929496526718], [-0.17834779620170593, -0.18179376423358917, 0.10259301960468292, 0.15479432046413422, -0.10825338214635849, -0.06521096080541611, 0.146340012550354, -0.001083147362805903, 0.12271949648857117, -0.06154351308941841, 0.2789633870124817, 0.12214876711368561, -0.13474710285663605, -0.17928390204906464, 0.0012490306980907917, -0.12813898921012878, -0.023086264729499817, 0.0972433090209961, -0.1608451008796692, 0.19160549342632294, 0.2521495223045349, 0.12686042487621307, 0.07571724057197571, -0.026192139834165573, -0.026955025270581245, -0.1423896849155426, 0.17692580819129944, -0.06965833902359009, -0.10564811527729034, -0.21815523505210876, 0.0620906725525856, -0.0275442972779274], [-0.13886623084545135, 0.035099878907203674, 0.06714680045843124, -0.11291522532701492, 0.12246403843164444, 0.13322770595550537, 0.04473076015710831, 0.16751810908317566, 0.01486955489963293, -0.13454319536685944, 0.005621804855763912, -0.1909317970275879, -0.22229956090450287, -0.08704254776239395, 0.1915408968925476, 0.1759108155965805, -0.10866273939609528, 0.00021132876281626523, -0.05446673184633255, 0.15886129438877106, -0.10270021110773087, -0.19933649897575378, -0.032030556350946426, -0.06619200855493546, 0.17673318088054657, 0.1432376205921173, -0.20675918459892273, -0.2118469774723053, 0.12218126654624939, 0.16335023939609528, 0.0831303820014, 0.08957218378782272], [-0.15065640211105347, 0.1911419928073883, -0.07396581023931503, -0.22939838469028473, 0.004254110623151064, -0.08171544224023819, -0.08602557331323624, 0.0038625476881861687, 0.12097868323326111, 0.033891789615154266, -0.22926275432109833, 0.2919003963470459, 0.159878209233284, -0.133025661110878, -0.040570225566625595, 0.08353455364704132, 0.08792870491743088, 0.04744434729218483, 0.18314985930919647, -0.0027135934215039015, -0.1013917475938797, 0.013387379236519337, -0.056366875767707825, 0.152442067861557, 0.11916380375623703, -0.16134528815746307, -0.1117316484451294, -0.24399426579475403, 0.05289791151881218, 0.11488666385412216, -0.12724383175373077, 0.12935395538806915], [-0.20444032549858093, 0.22263388335704803, -0.0991632342338562, -0.2313513457775116, 0.15194502472877502, 0.05592306703329086, 0.0004582873953040689, -0.14952142536640167, -0.11114728450775146, 0.23934516310691833, -0.05779764801263809, 0.16344106197357178, 0.12952923774719238, -0.2159530222415924, 0.13891007006168365, 0.0314098596572876, 0.14259660243988037, -0.24902358651161194, 0.04939419776201248, -0.2182489037513733, -0.07141317427158356, -0.06487713009119034, 0.07981791347265244, -0.13929370045661926, 0.15207627415657043, 0.20987313985824585, 0.17939697206020355, 0.005698545835912228, 0.18124695122241974, 0.04067780449986458, 0.17815452814102173, 0.17979121208190918], [-0.1358424574136734, 0.10589666664600372, 0.22116956114768982, -0.08952365815639496, 0.026180792599916458, 0.03136390075087547, 0.12403479963541031, -0.15632832050323486, -0.05216393992304802, -0.12291856855154037, -0.10281635075807571, 0.1791081428527832, -0.025410272181034088, -0.180103600025177, 0.19788891077041626, -0.028826458379626274, -0.0842878520488739, -0.11105900257825851, 0.1522054225206375, -0.17533235251903534, 0.07117575407028198, 0.11502963304519653, 0.08135561645030975, 0.12611310184001923, 0.10556463897228241, -0.10039691627025604, 0.09631060063838959, 0.24407434463500977, 0.10063272714614868, 0.008272462524473667, -0.20824868977069855, 0.13035371899604797], [-0.12406182289123535, -0.20440715551376343, 0.19716307520866394, 0.01201277133077383, -0.026170950382947922, -0.17467772960662842, 0.037682123482227325, -0.15577805042266846, -0.08999965339899063, -0.008405027911067009, 0.0859643816947937, -0.2504754364490509, 0.08022168278694153, -0.03858703374862671, 0.22717924416065216, 0.15032373368740082, -0.17343242466449738, 0.1587817668914795, -0.00457539688795805, 0.09485020488500595, -0.09443657100200653, 0.07124963402748108, 0.05603329837322235, 0.08454861491918564, -0.06376030296087265, -0.15777850151062012, 0.20111046731472015, 0.032750703394412994, -0.006305182818323374, 0.20680561661720276, -0.14717218279838562, 0.11619158089160919], [0.1864730268716812, -0.05126174911856651, 0.19160863757133484, -0.16854256391525269, 0.20366907119750977, 0.16760483384132385, 0.126410573720932, -0.07389936596155167, -0.10023041814565659, -0.1858060359954834, -0.20891089737415314, 0.21923844516277313, -0.05931510776281357, 0.020395437255501747, -0.1039041057229042, -0.08222049474716187, -0.10685519874095917, 0.05972649157047272, -0.11717421561479568, -0.12889833748340607, 0.19369660317897797, -0.016191022470593452, 0.06429383158683777, 0.0733853429555893, 0.10592319071292877, 0.1255675107240677, -0.1695900559425354, 0.22887621819972992, 0.054552409797906876, -0.11588793247938156, 0.03479183465242386, 0.042260296642780304], [0.13905639946460724, -0.057179760187864304, -0.04916059598326683, -0.06250828504562378, 0.16567392647266388, 0.11866272985935211, 0.09586647897958755, 0.009087074548006058, -0.05525326356291771, 0.24144341051578522, 0.12612640857696533, 0.07453896105289459, 0.1735595464706421, 0.09663143008947372, -0.2262951135635376, -0.11911417543888092, 0.02749137207865715, -0.09284880757331848, -0.10627401620149612, -0.1782580018043518, -0.10325630754232407, -0.17815089225769043, -0.07707520574331284, -0.046598099172115326, -0.1554270088672638, -0.07186951488256454, 0.08747094124555588, 0.03705746307969093, 0.06440328806638718, 0.0898168608546257, 0.03505101054906845, -0.1968279927968979], [-0.13708321750164032, 0.11182171106338501, 0.046733614057302475, -0.14778175950050354, 0.17865273356437683, -0.17757534980773926, -0.0665230005979538, 0.03901766240596771, 0.22246414422988892, -0.03789324685931206, 0.15637733042240143, -0.020651863887906075, -0.21028174459934235, 0.006084705702960491, 0.06705506145954132, 0.11168356984853745, -0.019873416051268578, 0.11805632710456848, -0.015067975036799908, -0.03249432519078255, 0.031328242272138596, 0.12789393961429596, -0.046232447028160095, 0.06958893686532974, -0.18470428884029388, 0.08969210833311081, -0.010939385741949081, 0.013073036447167397, -0.19440174102783203, -0.04257562756538391, 0.06749597936868668, 0.04069291800260544], [-0.16748450696468353, -0.20309683680534363, -0.0014529520412907004, 0.08262111246585846, -0.07483070343732834, 0.11921679973602295, -0.13645045459270477, -0.12755244970321655, -0.16535143554210663, -0.2097063660621643, -0.15743599832057953, 0.08910651504993439, 0.24483908712863922, -0.12537208199501038, -0.12691740691661835, -0.12460827082395554, 0.019472826272249222, -0.089646115899086, -0.06109745427966118, 0.2474278062582016, 0.26166486740112305, 0.07947193086147308, -0.02166881412267685, -0.09508782625198364, 0.06553542613983154, 0.08500665426254272, 0.15861859917640686, 0.0039453767240047455, 0.11335666477680206, -0.13320235908031464, 0.15385304391384125, 0.0958578810095787], [-0.008551007136702538, -0.14069217443466187, -0.12491270899772644, 0.0781039148569107, 0.06661079823970795, -0.03644086793065071, 0.25601673126220703, 0.00603018281981349, -0.1112489178776741, -0.08865456283092499, -0.15140537917613983, -0.10883144289255142, 0.1011773943901062, 0.07845872640609741, -0.16990116238594055, 0.20242932438850403, -0.010255761444568634, 0.16348282992839813, -0.20556415617465973, 0.09131518751382828, 0.03672625496983528, -0.01694711670279503, -0.021663308143615723, 0.12116385251283646, -0.08886958658695221, -0.14554643630981445, 0.0591169074177742, 0.22666893899440765, 0.08851984888315201, -0.09041831642389297, 0.13155066967010498, 0.04073082283139229], [-0.11427242308855057, 0.16703122854232788, 0.05953460559248924, 0.1397385448217392, 0.18387925624847412, 0.09742351621389389, 0.19195128977298737, 0.192972794175148, 0.0747532844543457, -0.20640210807323456, 0.1259227991104126, -0.11024338006973267, 0.21927732229232788, -0.11780579388141632, -0.09054198861122131, -0.05439450591802597, -0.09101829677820206, -0.05384908616542816, -0.25134220719337463, -0.15007932484149933, -0.10836087912321091, -0.0349343866109848, 0.04817577078938484, 0.10701613128185272, -0.03402923047542572, 0.11197979003190994, 0.1399330049753189, 0.1866370439529419, 0.1524939239025116, 0.1603829562664032, -0.11083879321813583, -0.002785385586321354], [0.025469761341810226, 0.10672593116760254, 0.2554846704006195, 0.20824187994003296, -0.07925184071063995, 0.23800672590732574, 0.25147122144699097, -0.1570960134267807, 0.13079948723316193, 0.2077445387840271, -0.1650930792093277, -0.1318487673997879, 0.18387305736541748, -0.0034784949384629726, 0.21290312707424164, 0.19940190017223358, -0.05443830415606499, 0.15211732685565948, 0.1917576789855957, 0.16881579160690308, 0.22530800104141235, 0.03650691360235214, 0.011815019883215427, 0.09490291029214859, -0.04489372670650482, -0.20611335337162018, 0.16185890138149261, 0.10638986527919769, 0.19169774651527405, -0.11870519071817398, 0.07568784803152084, -0.07198689132928848], [-0.22893665730953217, 0.1734846532344818, -0.20433162152767181, -0.162679985165596, 0.09727758169174194, 0.03128597512841225, 0.10515403002500534, 0.04283905774354935, -0.16077573597431183, -0.1670396327972412, -0.13266372680664062, 0.14351443946361542, 0.08325261622667313, 0.14030998945236206, -0.2057211697101593, 0.19695428013801575, -0.009242975153028965, 0.220002219080925, 0.12236712872982025, -0.006323172710835934, 0.22644180059432983, -0.04510775953531265, -0.12245277315378189, -0.09839469194412231, -0.1961541771888733, 0.17720454931259155, 0.2342289835214615, 0.13499635457992554, -0.09657399356365204, 0.09638277441263199, 0.2165564000606537, -0.00029753829585388303], [0.047857265919446945, 0.19262269139289856, 0.14899593591690063, 0.1872769296169281, 0.12172999233007431, -0.09996092319488525, 0.14355042576789856, 0.1403621882200241, 0.2032482773065567, -0.21419741213321686, 0.05864427611231804, -0.13886381685733795, -0.22253543138504028, -0.05270639434456825, 0.20637303590774536, -0.09444008022546768, -0.0411650724709034, -0.21634143590927124, -0.12537989020347595, -0.1310010701417923, -0.06535272300243378, -0.024177972227334976, 0.07075394690036774, -0.024868234992027283, 0.226250559091568, -0.08585841953754425, -0.052027441561222076, 0.19055482745170593, 0.09992140531539917, -0.025902945548295975, -0.0873289555311203, 0.19448915123939514], [-0.12794511020183563, -0.12439526617527008, -0.05202360823750496, 0.13092954456806183, 0.0806889533996582, -0.09711147099733353, 0.13950365781784058, -0.10453931987285614, 0.0528571754693985, 0.17861080169677734, -0.026442700996994972, -0.07473013550043106, 0.10169597715139389, -0.1267155110836029, 0.17675653100013733, 0.15697963535785675, -0.08608334511518478, 0.05666330084204674, 0.04804595187306404, -0.039311252534389496, 0.061575859785079956, 0.13512051105499268, 0.07752858102321625, 0.20355606079101562, 0.10994532704353333, -0.10167180001735687, 0.04455725848674774, 0.2805868089199066, -0.15438686311244965, 0.20102517306804657, 0.08107668906450272, -0.1047363430261612], [-0.05624939128756523, 0.004623835440725088, -0.11879483610391617, -0.005061590578407049, 0.07490972429513931, -0.05096777155995369, -0.13975371420383453, -0.08274703472852707, 0.10835418105125427, -0.06926030665636063, -0.027522346004843712, 0.0360102578997612, 0.09373808652162552, -0.09218528866767883, 0.18587161600589752, 0.15719832479953766, -0.017275379970669746, -0.03804023191332817, -0.041278548538684845, 0.195309579372406, 0.18592116236686707, 0.04319431260228157, 0.03801008686423302, -0.07695458084344864, -0.07689301669597626, 0.2010188102722168, -0.16754324734210968, -0.1809481978416443, 0.20756173133850098, 0.17451299726963043, -0.025056330487132072, 0.11540155112743378], [0.06654408574104309, 0.061879947781562805, -0.018906764686107635, -0.05580785498023033, 0.16571730375289917, -0.0238387119024992, -0.040427472442388535, 0.034892067313194275, -0.16323788464069366, -0.06773187965154648, 0.07201125472784042, 0.05845089629292488, 0.010808734223246574, 0.20372657477855682, 0.18839751183986664, 0.05910765752196312, -0.12368667125701904, -0.10043996572494507, 0.11652066558599472, -0.12157974392175674, 0.10631810128688812, -0.12204983085393906, -0.10090798139572144, 0.028874875977635384, 0.1891138106584549, -0.1557571440935135, 0.11231988668441772, -0.017462177202105522, 0.16828304529190063, 0.06556212157011032, 0.26578956842422485, -0.07432089000940323], [-0.0926080197095871, 0.13948939740657806, 0.2305157482624054, 0.13386325538158417, -0.033395782113075256, 0.08256768435239792, -0.0016942948568612337, 0.053422823548316956, 0.15368209779262543, 0.27374032139778137, -0.07880501449108124, -0.15029260516166687, 0.2126871794462204, -0.2105138748884201, 0.2373250126838684, -0.06873165816068649, -0.02975786104798317, 0.25126928091049194, 0.06094333902001381, 0.12528586387634277, 0.2037561535835266, -0.14260654151439667, 0.15998733043670654, -0.1612062156200409, -0.10995958745479584, 0.13810059428215027, -0.04056157171726227, -0.18332746624946594, -0.09019497036933899, -0.04512587562203407, -0.1970306932926178, 0.1591377705335617], [0.04581509158015251, 0.20888374745845795, -0.11359836906194687, 0.14990556240081787, 0.05607876554131508, 0.012690543197095394, -0.09089110791683197, -0.18404705822467804, -0.02637648954987526, 0.040983427315950394, 0.23002441227436066, 0.06882478296756744, -0.023629210889339447, -0.07558661699295044, 0.21443219482898712, -0.10651510953903198, 0.07176338881254196, 0.16162557899951935, 0.07294834405183792, -0.13073791563510895, 0.20473091304302216, 0.055454932153224945, -0.04498344287276268, 0.1803467869758606, 0.22342586517333984, -0.15594364702701569, 0.009110522456467152, -0.041132599115371704, 0.16334563493728638, -0.1497558355331421, -0.06393766403198242, 0.1013178676366806], [-0.001244286191649735, -0.09860887378454208, -0.1173505187034607, 0.18790826201438904, 0.018316693603992462, -0.01778135448694229, -0.10495137423276901, 0.12720617651939392, -0.05927133187651634, 0.025041360408067703, 0.1952511966228485, 0.021141061559319496, 0.023448292165994644, -0.02753795124590397, -0.03508797287940979, -0.17813362181186676, 0.21904590725898743, -0.02140885218977928, -0.20549187064170837, -0.05320823937654495, 0.1183488667011261, -0.009846585802733898, -0.046739641577005386, -0.004148826934397221, -0.08216342329978943, -0.21328970789909363, -0.20562423765659332, -0.17375043034553528, -0.01564871147274971, 0.07077179849147797, 0.07315640896558762, 0.05474177002906799], [-0.08229750394821167, 0.14896102249622345, 0.2697473466396332, 0.20501691102981567, 0.17274151742458344, -0.17431265115737915, 0.07597976177930832, 0.0686400905251503, 0.04512244835495949, 0.006833680905401707, 0.13689211010932922, 0.21632441878318787, 0.06351078301668167, -0.10138934850692749, -0.13914155960083008, 0.14856700599193573, -0.055027902126312256, -0.18933725357055664, -0.22196878492832184, 0.023373756557703018, 0.22575686872005463, -0.09153218567371368, -0.0606989711523056, 0.09061630070209503, -0.05551939830183983, 0.1791715770959854, 0.13816618919372559, 0.20261256396770477, 0.11285655945539474, 0.022860484197735786, 0.009214909747242928, 0.1315682828426361], [-0.10224734991788864, 0.16034917533397675, -0.22334317862987518, -0.17155767977237701, -0.09851701557636261, 0.21196696162223816, -0.19760601222515106, 0.10394033044576645, -0.05330437049269676, -0.12967263162136078, -0.21349504590034485, -0.017420442774891853, -0.09495333582162857, 0.14020559191703796, -0.08520288020372391, -0.049427568912506104, 0.0819210559129715, -0.25939011573791504, -0.2555290758609772, -0.26151609420776367, 0.1939259022474289, -0.13371607661247253, 0.025270504876971245, 0.05159406736493111, 0.22090758383274078, -0.005819694139063358, -0.15462107956409454, -0.16288189589977264, 0.1858641505241394, -0.08863461017608643, 0.19750604033470154, 0.01640493795275688], [0.057538699358701706, -0.0495355948805809, 0.11814145743846893, -0.13287746906280518, -0.09539686888456345, -0.20066459476947784, 0.08780671656131744, 0.07523505389690399, 0.1537202149629593, 0.14882969856262207, 0.21437354385852814, 0.2016856074333191, 0.1057949885725975, 0.03945685178041458, -0.18184109032154083, -0.013258608989417553, -0.09954879432916641, -0.17116676270961761, -0.09184882044792175, -0.11305508762598038, 0.020084932446479797, 0.025283530354499817, -0.05222645401954651, -0.10667730867862701, -0.14744450151920319, -0.007951481267809868, 0.25436216592788696, 0.17035508155822754, 0.1952715516090393, 0.03347281366586685, 0.2349974364042282, -0.08961015939712524], [-0.10744253545999527, 0.05892043560743332, 0.08064945042133331, -0.1623215228319168, -0.1752762347459793, -0.19567802548408508, -0.11839702725410461, -0.11295995861291885, 0.1711263209581375, 0.01851641573011875, 0.00911801028996706, -0.006362629123032093, 0.1543097198009491, 0.04705161601305008, -0.12117704749107361, 0.0020524440333247185, -0.0016049686819314957, 0.188528373837471, 0.048143431544303894, -0.1059904545545578, 0.1628182977437973, -0.1250493973493576, 0.07050162553787231, -0.0004553945327643305, -0.022372251376509666, 0.11160594969987869, 0.19545167684555054, 0.1640544980764389, -0.017188992351293564, -0.03997078165411949, -0.11126420646905899, 0.13861830532550812], [0.1954081654548645, 0.01663319021463394, -0.022318603470921516, 0.044073741883039474, -0.09623744338750839, 0.25780996680259705, -0.13924692571163177, 0.002513728803023696, -0.17661838233470917, 0.22249867022037506, 0.23436224460601807, -0.08956583589315414, 0.08338785171508789, 0.06733930855989456, 0.028572527691721916, 0.1793096661567688, 0.08988098800182343, -0.002894163131713867, -0.07835638523101807, -0.1687234342098236, 0.2084784209728241, 0.16977249085903168, -0.03934898227453232, -0.021723000332713127, 0.029671259224414825, 0.2658054232597351, -0.22673572599887848, -0.21903426945209503, 0.24729955196380615, -0.015449370257556438, 0.1479663997888565, 0.20488059520721436], [-0.18740776181221008, -0.0263910423964262, -0.055039700120687485, -0.02953585423529148, 0.1478830724954605, 0.11524628847837448, -0.13701339066028595, -0.1383093148469925, -0.1223459392786026, -0.022762883454561234, 0.07162372022867203, 0.24560120701789856, -0.20757685601711273, -0.11090269684791565, -0.004403506871312857, -0.027270033955574036, 0.004663000348955393, -0.09583710134029388, 0.07687873393297195, 0.14549048244953156, 0.028246460482478142, 0.1767885535955429, -0.04155538231134415, -0.15538717806339264, -0.18304012715816498, 0.17174850404262543, -0.11504951864480972, -0.06272771954536438, 